export default [
  {
    n: '北京',
    c: '11',
    s: {
      n: '北京',
      c: '01',
      city: [
        {
          n: '东城区',
          c: '01'
        },
        {
          n: '西城区',
          c: '02'
        },
        {
          n: '崇文区',
          c: '03'
        },
        {
          n: '宣武区',
          c: '04'
        },
        {
          n: '朝阳区',
          c: '05'
        },
        {
          n: '丰台区',
          c: '06'
        },
        {
          n: '石景山区',
          c: '07'
        },
        {
          n: '海淀区',
          c: '08'
        },
        {
          n: '门头沟区',
          c: '09'
        },
        {
          n: '房山区',
          c: '11'
        },
        {
          n: '通州区',
          c: '12'
        },
        {
          n: '顺义区',
          c: '13'
        },
        {
          n: '昌平区',
          c: '14'
        },
        {
          n: '大兴区',
          c: '15'
        },
        {
          n: '怀柔区',
          c: '16'
        },
        {
          n: '平谷区',
          c: '17'
        },
        {
          n: '密云县',
          c: '28'
        },
        {
          n: '延庆县',
          c: '29'
        }
      ]
    }
  },
  {
    n: '天津',
    c: '12',
    s: {
      n: '天津',
      c: '01',
      city: [
        {
          n: '和平区',
          c: '01'
        },
        {
          n: '河东区',
          c: '02'
        },
        {
          n: '河西区',
          c: '03'
        },
        {
          n: '南开区',
          c: '04'
        },
        {
          n: '河北区',
          c: '05'
        },
        {
          n: '红桥区',
          c: '06'
        },
        {
          n: '塘沽区',
          c: '07'
        },
        {
          n: '汉沽区',
          c: '08'
        },
        {
          n: '大港区',
          c: '09'
        },
        {
          n: '东丽区',
          c: '10'
        },
        {
          n: '西青区',
          c: '11'
        },
        {
          n: '津南区',
          c: '12'
        },
        {
          n: '北辰区',
          c: '13'
        },
        {
          n: '武清区',
          c: '14'
        },
        {
          n: '宝坻区',
          c: '15'
        },
        {
          n: '宁河县',
          c: '21'
        },
        {
          n: '静海县',
          c: '23'
        },
        {
          n: '蓟县',
          c: '25'
        }
      ]
    }
  },
  {
    n: '河北',
    c: '13',
    s: [
      {
        n: '石家庄市',
        c: '01',
        city: [
          {
            n: '长安区',
            c: '02'
          },
          {
            n: '桥东区',
            c: '03'
          },
          {
            n: '桥西区',
            c: '04'
          },
          {
            n: '新华区',
            c: '05'
          },
          {
            n: '井陉矿区',
            c: '07'
          },
          {
            n: '裕华区',
            c: '08'
          },
          {
            n: '井陉县',
            c: '21'
          },
          {
            n: '正定县',
            c: '23'
          },
          {
            n: '栾城县',
            c: '24'
          },
          {
            n: '行唐县',
            c: '25'
          },
          {
            n: '灵寿县',
            c: '26'
          },
          {
            n: '高邑县',
            c: '27'
          },
          {
            n: '深泽县',
            c: '28'
          },
          {
            n: '赞皇县',
            c: '29'
          },
          {
            n: '无极县',
            c: '30'
          },
          {
            n: '平山县',
            c: '31'
          },
          {
            n: '元氏县',
            c: '32'
          },
          {
            n: '赵县',
            c: '33'
          },
          {
            n: '辛集市',
            c: '81'
          },
          {
            n: '藁城市',
            c: '82'
          },
          {
            n: '晋州市',
            c: '83'
          },
          {
            n: '新乐市',
            c: '84'
          },
          {
            n: '鹿泉市',
            c: '85'
          }
        ]
      },
      {
        n: '唐山市',
        c: '02',
        city: [
          {
            n: '路南区',
            c: '02'
          },
          {
            n: '路北区',
            c: '03'
          },
          {
            n: '古冶区',
            c: '04'
          },
          {
            n: '开平区',
            c: '05'
          },
          {
            n: '丰南区',
            c: '07'
          },
          {
            n: '丰润区',
            c: '08'
          },
          {
            n: '滦县',
            c: '23'
          },
          {
            n: '滦南县',
            c: '24'
          },
          {
            n: '乐亭县',
            c: '25'
          },
          {
            n: '迁西县',
            c: '27'
          },
          {
            n: '玉田县',
            c: '29'
          },
          {
            n: '唐海县',
            c: '30'
          },
          {
            n: '遵化市',
            c: '81'
          },
          {
            n: '迁安市',
            c: '83'
          }
        ]
      },
      {
        n: '秦皇岛市',
        c: '03',
        city: [
          {
            n: '海港区',
            c: '02'
          },
          {
            n: '山海关区',
            c: '03'
          },
          {
            n: '北戴河区',
            c: '04'
          },
          {
            n: '青龙满族自治县',
            c: '21'
          },
          {
            n: '昌黎县',
            c: '22'
          },
          {
            n: '抚宁县',
            c: '23'
          },
          {
            n: '卢龙县',
            c: '24'
          }
        ]
      },
      {
        n: '邯郸市',
        c: '04',
        city: [
          {
            n: '邯山区',
            c: '02'
          },
          {
            n: '丛台区',
            c: '03'
          },
          {
            n: '复兴区',
            c: '04'
          },
          {
            n: '峰峰矿区',
            c: '06'
          },
          {
            n: '邯郸县',
            c: '21'
          },
          {
            n: '临漳县',
            c: '23'
          },
          {
            n: '成安县',
            c: '24'
          },
          {
            n: '大名县',
            c: '25'
          },
          {
            n: '涉县',
            c: '26'
          },
          {
            n: '磁县',
            c: '27'
          },
          {
            n: '肥乡县',
            c: '28'
          },
          {
            n: '永年县',
            c: '29'
          },
          {
            n: '邱县',
            c: '30'
          },
          {
            n: '鸡泽县',
            c: '31'
          },
          {
            n: '广平县',
            c: '32'
          },
          {
            n: '馆陶县',
            c: '33'
          },
          {
            n: '魏县',
            c: '34'
          },
          {
            n: '曲周县',
            c: '35'
          },
          {
            n: '武安市',
            c: '81'
          }
        ]
      },
      {
        n: '邢台市',
        c: '05',
        city: [
          {
            n: '桥东区',
            c: '02'
          },
          {
            n: '桥西区',
            c: '03'
          },
          {
            n: '邢台县',
            c: '21'
          },
          {
            n: '临城县',
            c: '22'
          },
          {
            n: '内丘县',
            c: '23'
          },
          {
            n: '柏乡县',
            c: '24'
          },
          {
            n: '隆尧县',
            c: '25'
          },
          {
            n: '任县',
            c: '26'
          },
          {
            n: '南和县',
            c: '27'
          },
          {
            n: '宁晋县',
            c: '28'
          },
          {
            n: '巨鹿县',
            c: '29'
          },
          {
            n: '新河县',
            c: '30'
          },
          {
            n: '广宗县',
            c: '31'
          },
          {
            n: '平乡县',
            c: '32'
          },
          {
            n: '威县',
            c: '33'
          },
          {
            n: '清河县',
            c: '34'
          },
          {
            n: '临西县',
            c: '35'
          },
          {
            n: '南宫市',
            c: '81'
          },
          {
            n: '沙河市',
            c: '82'
          }
        ]
      },
      {
        n: '保定市',
        c: '06',
        city: [
          {
            n: '新市区',
            c: '02'
          },
          {
            n: '北市区',
            c: '03'
          },
          {
            n: '南市区',
            c: '04'
          },
          {
            n: '满城县',
            c: '21'
          },
          {
            n: '清苑县',
            c: '22'
          },
          {
            n: '涞水县',
            c: '23'
          },
          {
            n: '阜平县',
            c: '24'
          },
          {
            n: '徐水县',
            c: '25'
          },
          {
            n: '定兴县',
            c: '26'
          },
          {
            n: '唐县',
            c: '27'
          },
          {
            n: '高阳县',
            c: '28'
          },
          {
            n: '容城县',
            c: '29'
          },
          {
            n: '涞源县',
            c: '30'
          },
          {
            n: '望都县',
            c: '31'
          },
          {
            n: '安新县',
            c: '32'
          },
          {
            n: '易县',
            c: '33'
          },
          {
            n: '曲阳县',
            c: '34'
          },
          {
            n: '蠡县',
            c: '35'
          },
          {
            n: '顺平县',
            c: '36'
          },
          {
            n: '博野县',
            c: '37'
          },
          {
            n: '雄县',
            c: '38'
          },
          {
            n: '涿州市',
            c: '81'
          },
          {
            n: '定州市',
            c: '82'
          },
          {
            n: '安国市',
            c: '83'
          },
          {
            n: '高碑店市',
            c: '84'
          }
        ]
      },
      {
        n: '张家口市',
        c: '07',
        city: [
          {
            n: '桥东区',
            c: '02'
          },
          {
            n: '桥西区',
            c: '03'
          },
          {
            n: '宣化区',
            c: '05'
          },
          {
            n: '下花园区',
            c: '06'
          },
          {
            n: '宣化县',
            c: '21'
          },
          {
            n: '张北县',
            c: '22'
          },
          {
            n: '康保县',
            c: '23'
          },
          {
            n: '沽源县',
            c: '24'
          },
          {
            n: '尚义县',
            c: '25'
          },
          {
            n: '蔚县',
            c: '26'
          },
          {
            n: '阳原县',
            c: '27'
          },
          {
            n: '怀安县',
            c: '28'
          },
          {
            n: '万全县',
            c: '29'
          },
          {
            n: '怀来县',
            c: '30'
          },
          {
            n: '涿鹿县',
            c: '31'
          },
          {
            n: '赤城县',
            c: '32'
          },
          {
            n: '崇礼县',
            c: '33'
          }
        ]
      },
      {
        n: '承德市',
        c: '08',
        city: [
          {
            n: '双桥区',
            c: '02'
          },
          {
            n: '双滦区',
            c: '03'
          },
          {
            n: '鹰手营子矿区',
            c: '04'
          },
          {
            n: '承德县',
            c: '21'
          },
          {
            n: '兴隆县',
            c: '22'
          },
          {
            n: '平泉县',
            c: '23'
          },
          {
            n: '滦平县',
            c: '24'
          },
          {
            n: '隆化县',
            c: '25'
          },
          {
            n: '丰宁满族自治县',
            c: '26'
          },
          {
            n: '宽城满族自治县',
            c: '27'
          },
          {
            n: '围场满族蒙古族自治县',
            c: '28'
          }
        ]
      },
      {
        n: '沧州市',
        c: '09',
        city: [
          {
            n: '新华区',
            c: '02'
          },
          {
            n: '运河区',
            c: '03'
          },
          {
            n: '沧县',
            c: '21'
          },
          {
            n: '青县',
            c: '22'
          },
          {
            n: '东光县',
            c: '23'
          },
          {
            n: '海兴县',
            c: '24'
          },
          {
            n: '盐山县',
            c: '25'
          },
          {
            n: '肃宁县',
            c: '26'
          },
          {
            n: '南皮县',
            c: '27'
          },
          {
            n: '吴桥县',
            c: '28'
          },
          {
            n: '献县',
            c: '29'
          },
          {
            n: '孟村回族自治县',
            c: '30'
          },
          {
            n: '泊头市',
            c: '81'
          },
          {
            n: '任丘市',
            c: '82'
          },
          {
            n: '黄骅市',
            c: '83'
          },
          {
            n: '河间市',
            c: '84'
          }
        ]
      },
      {
        n: '廊坊市',
        c: '10',
        city: [
          {
            n: '安次区',
            c: '02'
          },
          {
            n: '广阳区',
            c: '03'
          },
          {
            n: '固安县',
            c: '22'
          },
          {
            n: '永清县',
            c: '23'
          },
          {
            n: '香河县',
            c: '24'
          },
          {
            n: '大城县',
            c: '25'
          },
          {
            n: '文安县',
            c: '26'
          },
          {
            n: '大厂回族自治县',
            c: '28'
          },
          {
            n: '霸州市',
            c: '81'
          },
          {
            n: '三河市',
            c: '82'
          }
        ]
      },
      {
        n: '衡水市',
        c: '11',
        city: [
          {
            n: '桃城区',
            c: '02'
          },
          {
            n: '枣强县',
            c: '21'
          },
          {
            n: '武邑县',
            c: '22'
          },
          {
            n: '武强县',
            c: '23'
          },
          {
            n: '饶阳县',
            c: '24'
          },
          {
            n: '安平县',
            c: '25'
          },
          {
            n: '故城县',
            c: '26'
          },
          {
            n: '景县',
            c: '27'
          },
          {
            n: '阜城县',
            c: '28'
          },
          {
            n: '冀州市',
            c: '81'
          },
          {
            n: '深州市',
            c: '82'
          }
        ]
      }
    ]
  },
  {
    n: '山西',
    c: '14',
    s: [
      {
        n: '太原市',
        c: '01',
        city: [
          {
            n: '小店区',
            c: '05'
          },
          {
            n: '迎泽区',
            c: '06'
          },
          {
            n: '杏花岭区',
            c: '07'
          },
          {
            n: '尖草坪区',
            c: '08'
          },
          {
            n: '万柏林区',
            c: '09'
          },
          {
            n: '晋源区',
            c: '10'
          },
          {
            n: '清徐县',
            c: '21'
          },
          {
            n: '阳曲县',
            c: '22'
          },
          {
            n: '娄烦县',
            c: '23'
          },
          {
            n: '古交市',
            c: '81'
          }
        ]
      },
      {
        n: '大同市',
        c: '02',
        city: [
          {
            n: '城区',
            c: '02'
          },
          {
            n: '矿区',
            c: '03'
          },
          {
            n: '南郊区',
            c: '11'
          },
          {
            n: '新荣区',
            c: '12'
          },
          {
            n: '阳高县',
            c: '21'
          },
          {
            n: '天镇县',
            c: '22'
          },
          {
            n: '广灵县',
            c: '23'
          },
          {
            n: '灵丘县',
            c: '24'
          },
          {
            n: '浑源县',
            c: '25'
          },
          {
            n: '左云县',
            c: '26'
          },
          {
            n: '大同县',
            c: '27'
          }
        ]
      },
      {
        n: '阳泉市',
        c: '03',
        city: [
          {
            n: '城区',
            c: '02'
          },
          {
            n: '矿区',
            c: '03'
          },
          {
            n: '郊区',
            c: '11'
          },
          {
            n: '平定县',
            c: '21'
          },
          {
            n: '盂县',
            c: '22'
          }
        ]
      },
      {
        n: '长治市',
        c: '04',
        city: [
          {
            n: '城区',
            c: '02'
          },
          {
            n: '郊区',
            c: '11'
          },
          {
            n: '长治县',
            c: '21'
          },
          {
            n: '襄垣县',
            c: '23'
          },
          {
            n: '屯留县',
            c: '24'
          },
          {
            n: '平顺县',
            c: '25'
          },
          {
            n: '黎城县',
            c: '26'
          },
          {
            n: '壶关县',
            c: '27'
          },
          {
            n: '长子县',
            c: '28'
          },
          {
            n: '武乡县',
            c: '29'
          },
          {
            n: '沁县',
            c: '30'
          },
          {
            n: '沁源县',
            c: '31'
          },
          {
            n: '潞城市',
            c: '81'
          }
        ]
      },
      {
        n: '晋城市',
        c: '05',
        city: [
          {
            n: '城区',
            c: '02'
          },
          {
            n: '沁水县',
            c: '21'
          },
          {
            n: '阳城县',
            c: '22'
          },
          {
            n: '陵川县',
            c: '24'
          },
          {
            n: '泽州县',
            c: '25'
          },
          {
            n: '高平市',
            c: '81'
          }
        ]
      },
      {
        n: '朔州市',
        c: '06',
        city: [
          {
            n: '朔城区',
            c: '02'
          },
          {
            n: '平鲁区',
            c: '03'
          },
          {
            n: '山阴县',
            c: '21'
          },
          {
            n: '应县',
            c: '22'
          },
          {
            n: '右玉县',
            c: '23'
          },
          {
            n: '怀仁县',
            c: '24'
          }
        ]
      },
      {
        n: '晋中市',
        c: '07',
        city: [
          {
            n: '榆次区',
            c: '02'
          },
          {
            n: '榆社县',
            c: '21'
          },
          {
            n: '左权县',
            c: '22'
          },
          {
            n: '和顺县',
            c: '23'
          },
          {
            n: '昔阳县',
            c: '24'
          },
          {
            n: '寿阳县',
            c: '25'
          },
          {
            n: '太谷县',
            c: '26'
          },
          {
            n: '祁县',
            c: '27'
          },
          {
            n: '平遥县',
            c: '28'
          },
          {
            n: '灵石县',
            c: '29'
          },
          {
            n: '介休市',
            c: '81'
          }
        ]
      },
      {
        n: '运城市',
        c: '08',
        city: [
          {
            n: '盐湖区',
            c: '02'
          },
          {
            n: '临猗县',
            c: '21'
          },
          {
            n: '万荣县',
            c: '22'
          },
          {
            n: '闻喜县',
            c: '23'
          },
          {
            n: '稷山县',
            c: '24'
          },
          {
            n: '新绛县',
            c: '25'
          },
          {
            n: '绛县',
            c: '26'
          },
          {
            n: '垣曲县',
            c: '27'
          },
          {
            n: '夏县',
            c: '28'
          },
          {
            n: '平陆县',
            c: '29'
          },
          {
            n: '芮城县',
            c: '30'
          },
          {
            n: '永济市',
            c: '81'
          },
          {
            n: '河津市',
            c: '82'
          }
        ]
      },
      {
        n: '忻州市',
        c: '09',
        city: [
          {
            n: '忻府区',
            c: '02'
          },
          {
            n: '定襄县',
            c: '21'
          },
          {
            n: '五台县',
            c: '22'
          },
          {
            n: '代县',
            c: '23'
          },
          {
            n: '繁峙县',
            c: '24'
          },
          {
            n: '宁武县',
            c: '25'
          },
          {
            n: '静乐县',
            c: '26'
          },
          {
            n: '神池县',
            c: '27'
          },
          {
            n: '五寨县',
            c: '28'
          },
          {
            n: '岢岚县',
            c: '29'
          },
          {
            n: '河曲县',
            c: '30'
          },
          {
            n: '保德县',
            c: '31'
          },
          {
            n: '偏关县',
            c: '32'
          },
          {
            n: '原平市',
            c: '81'
          }
        ]
      },
      {
        n: '临汾市',
        c: '10',
        city: [
          {
            n: '尧都区',
            c: '02'
          },
          {
            n: '曲沃县',
            c: '21'
          },
          {
            n: '翼城县',
            c: '22'
          },
          {
            n: '襄汾县',
            c: '23'
          },
          {
            n: '洪洞县',
            c: '24'
          },
          {
            n: '古县',
            c: '25'
          },
          {
            n: '安泽县',
            c: '26'
          },
          {
            n: '浮山县',
            c: '27'
          },
          {
            n: '吉县',
            c: '28'
          },
          {
            n: '乡宁县',
            c: '29'
          },
          {
            n: '大宁县',
            c: '30'
          },
          {
            n: '隰县',
            c: '31'
          },
          {
            n: '永和县',
            c: '32'
          },
          {
            n: '蒲县',
            c: '33'
          },
          {
            n: '汾西县',
            c: '34'
          },
          {
            n: '侯马市',
            c: '81'
          },
          {
            n: '霍州市',
            c: '82'
          }
        ]
      },
      {
        n: '吕梁市',
        c: '11',
        city: [
          {
            n: '离石区',
            c: '02'
          },
          {
            n: '文水县',
            c: '21'
          },
          {
            n: '交城县',
            c: '22'
          },
          {
            n: '兴县',
            c: '23'
          },
          {
            n: '临县',
            c: '24'
          },
          {
            n: '柳林县',
            c: '25'
          },
          {
            n: '石楼县',
            c: '26'
          },
          {
            n: '岚县',
            c: '27'
          },
          {
            n: '方山县',
            c: '28'
          },
          {
            n: '中阳县',
            c: '29'
          },
          {
            n: '交口县',
            c: '30'
          },
          {
            n: '孝义市',
            c: '81'
          },
          {
            n: '汾阳市',
            c: '82'
          }
        ]
      }
    ]
  },
  {
    n: '内蒙古',
    c: '15',
    s: [
      {
        n: '呼和浩特市',
        c: '01',
        city: [
          {
            n: '新城区',
            c: '02'
          },
          {
            n: '回民区',
            c: '03'
          },
          {
            n: '玉泉区',
            c: '04'
          },
          {
            n: '赛罕区',
            c: '05'
          },
          {
            n: '土默特左旗',
            c: '21'
          },
          {
            n: '托克托县',
            c: '22'
          },
          {
            n: '和林格尔县',
            c: '23'
          },
          {
            n: '清水河县',
            c: '24'
          },
          {
            n: '武川县',
            c: '25'
          }
        ]
      },
      {
        n: '包头市',
        c: '02',
        city: [
          {
            n: '东河区',
            c: '02'
          },
          {
            n: '昆都仑区',
            c: '03'
          },
          {
            n: '青山区',
            c: '04'
          },
          {
            n: '石拐区',
            c: '05'
          },
          {
            n: '白云矿区',
            c: '06'
          },
          {
            n: '九原区',
            c: '07'
          },
          {
            n: '土默特右旗',
            c: '21'
          },
          {
            n: '固阳县',
            c: '22'
          },
          {
            n: '达尔罕茂明安联合旗',
            c: '23'
          }
        ]
      },
      {
        n: '乌海市',
        c: '03',
        city: [
          {
            n: '海勃湾区',
            c: '02'
          },
          {
            n: '海南区',
            c: '03'
          },
          {
            n: '乌达区',
            c: '04'
          }
        ]
      },
      {
        n: '赤峰市',
        c: '04',
        city: [
          {
            n: '红山区',
            c: '02'
          },
          {
            n: '元宝山区',
            c: '03'
          },
          {
            n: '松山区',
            c: '04'
          },
          {
            n: '阿鲁科尔沁旗',
            c: '21'
          },
          {
            n: '巴林左旗',
            c: '22'
          },
          {
            n: '巴林右旗',
            c: '23'
          },
          {
            n: '林西县',
            c: '24'
          },
          {
            n: '克什克腾旗',
            c: '25'
          },
          {
            n: '翁牛特旗',
            c: '26'
          },
          {
            n: '喀喇沁旗',
            c: '28'
          },
          {
            n: '宁城县',
            c: '29'
          },
          {
            n: '敖汉旗',
            c: '30'
          }
        ]
      },
      {
        n: '通辽市',
        c: '05',
        city: [
          {
            n: '科尔沁区',
            c: '02'
          },
          {
            n: '科尔沁左翼中旗',
            c: '21'
          },
          {
            n: '科尔沁左翼后旗',
            c: '22'
          },
          {
            n: '开鲁县',
            c: '23'
          },
          {
            n: '库伦旗',
            c: '24'
          },
          {
            n: '奈曼旗',
            c: '25'
          },
          {
            n: '扎鲁特旗',
            c: '26'
          },
          {
            n: '霍林郭勒市',
            c: '81'
          }
        ]
      },
      {
        n: '鄂尔多斯市',
        c: '06',
        city: [
          {
            n: '东胜区',
            c: '02'
          },
          {
            n: '达拉特旗',
            c: '21'
          },
          {
            n: '准格尔旗',
            c: '22'
          },
          {
            n: '鄂托克前旗',
            c: '23'
          },
          {
            n: '鄂托克旗',
            c: '24'
          },
          {
            n: '杭锦旗',
            c: '25'
          },
          {
            n: '乌审旗',
            c: '26'
          },
          {
            n: '伊金霍洛旗',
            c: '27'
          }
        ]
      },
      {
        n: '呼伦贝尔市',
        c: '07',
        city: [
          {
            n: '海拉尔区',
            c: '02'
          },
          {
            n: '阿荣旗',
            c: '21'
          },
          {
            n: '莫力达瓦达斡尔族自治旗',
            c: '22'
          },
          {
            n: '鄂伦春自治旗',
            c: '23'
          },
          {
            n: '鄂温克族自治旗',
            c: '24'
          },
          {
            n: '陈巴尔虎旗',
            c: '25'
          },
          {
            n: '新巴尔虎左旗',
            c: '26'
          },
          {
            n: '新巴尔虎右旗',
            c: '27'
          },
          {
            n: '满洲里市',
            c: '81'
          },
          {
            n: '牙克石市',
            c: '82'
          },
          {
            n: '扎兰屯市',
            c: '83'
          },
          {
            n: '额尔古纳市',
            c: '84'
          },
          {
            n: '根河市',
            c: '85'
          }
        ]
      },
      {
        n: '巴彦淖尔市',
        c: '08',
        city: [
          {
            n: '临河区',
            c: '02'
          },
          {
            n: '五原县',
            c: '21'
          },
          {
            n: '磴口县',
            c: '22'
          },
          {
            n: '乌拉特前旗',
            c: '23'
          },
          {
            n: '乌拉特中旗',
            c: '24'
          },
          {
            n: '乌拉特后旗',
            c: '25'
          },
          {
            n: '杭锦后旗',
            c: '26'
          }
        ]
      },
      {
        n: '乌兰察布市',
        c: '09',
        city: [
          {
            n: '集宁区',
            c: '02'
          },
          {
            n: '卓资县',
            c: '21'
          },
          {
            n: '化德县',
            c: '22'
          },
          {
            n: '商都县',
            c: '23'
          },
          {
            n: '兴和县',
            c: '24'
          },
          {
            n: '凉城县',
            c: '25'
          },
          {
            n: '察哈尔右翼前旗',
            c: '26'
          },
          {
            n: '察哈尔右翼中旗',
            c: '27'
          },
          {
            n: '察哈尔右翼后旗',
            c: '28'
          },
          {
            n: '四子王旗',
            c: '29'
          },
          {
            n: '丰镇市',
            c: '81'
          }
        ]
      },
      {
        n: '兴安盟',
        c: '22',
        city: [
          {
            n: '乌兰浩特市',
            c: '01'
          },
          {
            n: '阿尔山市',
            c: '02'
          },
          {
            n: '科尔沁右翼前旗',
            c: '21'
          },
          {
            n: '科尔沁右翼中旗',
            c: '22'
          },
          {
            n: '扎赉特旗',
            c: '23'
          },
          {
            n: '突泉县',
            c: '24'
          }
        ]
      },
      {
        n: '锡林郭勒盟',
        c: '25',
        city: [
          {
            n: '二连浩特市',
            c: '01'
          },
          {
            n: '锡林浩特市',
            c: '02'
          },
          {
            n: '阿巴嘎旗',
            c: '22'
          },
          {
            n: '苏尼特左旗',
            c: '23'
          },
          {
            n: '苏尼特右旗',
            c: '24'
          },
          {
            n: '东乌珠穆沁旗',
            c: '25'
          },
          {
            n: '西乌珠穆沁旗',
            c: '26'
          },
          {
            n: '太仆寺旗',
            c: '27'
          },
          {
            n: '镶黄旗',
            c: '28'
          },
          {
            n: '正镶白旗',
            c: '29'
          },
          {
            n: '正蓝旗',
            c: '30'
          },
          {
            n: '多伦县',
            c: '31'
          }
        ]
      },
      {
        n: '阿拉善盟',
        c: '29',
        city: [
          {
            n: '阿拉善左旗',
            c: '21'
          },
          {
            n: '阿拉善右旗',
            c: '22'
          },
          {
            n: '额济纳旗',
            c: '23'
          }
        ]
      }
    ]
  },
  {
    n: '辽宁',
    c: '21',
    s: [
      {
        n: '沈阳市',
        c: '01',
        city: [
          {
            n: '和平区',
            c: '02'
          },
          {
            n: '沈河区',
            c: '03'
          },
          {
            n: '大东区',
            c: '04'
          },
          {
            n: '皇姑区',
            c: '05'
          },
          {
            n: '铁西区',
            c: '06'
          },
          {
            n: '苏家屯区',
            c: '11'
          },
          {
            n: '东陵区',
            c: '12'
          },
          {
            n: '沈北新区',
            c: '13'
          },
          {
            n: '于洪区',
            c: '14'
          },
          {
            n: '辽中县',
            c: '22'
          },
          {
            n: '康平县',
            c: '23'
          },
          {
            n: '法库县',
            c: '24'
          },
          {
            n: '新民市',
            c: '81'
          }
        ]
      },
      {
        n: '大连市',
        c: '02',
        city: [
          {
            n: '中山区',
            c: '02'
          },
          {
            n: '西岗区',
            c: '03'
          },
          {
            n: '沙河口区',
            c: '04'
          },
          {
            n: '甘井子区',
            c: '11'
          },
          {
            n: '旅顺口区',
            c: '12'
          },
          {
            n: '金州区',
            c: '13'
          },
          {
            n: '长海县',
            c: '24'
          },
          {
            n: '瓦房店市',
            c: '81'
          },
          {
            n: '普兰店市',
            c: '82'
          },
          {
            n: '庄河市',
            c: '83'
          }
        ]
      },
      {
        n: '鞍山市',
        c: '03',
        city: [
          {
            n: '铁东区',
            c: '02'
          },
          {
            n: '铁西区',
            c: '03'
          },
          {
            n: '立山区',
            c: '04'
          },
          {
            n: '千山区',
            c: '11'
          },
          {
            n: '台安县',
            c: '21'
          },
          {
            n: '岫岩满族自治县',
            c: '23'
          },
          {
            n: '海城市',
            c: '81'
          }
        ]
      },
      {
        n: '抚顺市',
        c: '04',
        city: [
          {
            n: '新抚区',
            c: '02'
          },
          {
            n: '东洲区',
            c: '03'
          },
          {
            n: '望花区',
            c: '04'
          },
          {
            n: '顺城区',
            c: '11'
          },
          {
            n: '抚顺县',
            c: '21'
          },
          {
            n: '新宾满族自治县',
            c: '22'
          },
          {
            n: '清原满族自治县',
            c: '23'
          }
        ]
      },
      {
        n: '本溪市',
        c: '05',
        city: [
          {
            n: '平山区',
            c: '02'
          },
          {
            n: '溪湖区',
            c: '03'
          },
          {
            n: '明山区',
            c: '04'
          },
          {
            n: '南芬区',
            c: '05'
          },
          {
            n: '本溪满族自治县',
            c: '21'
          },
          {
            n: '桓仁满族自治县',
            c: '22'
          }
        ]
      },
      {
        n: '丹东市',
        c: '06',
        city: [
          {
            n: '元宝区',
            c: '02'
          },
          {
            n: '振兴区',
            c: '03'
          },
          {
            n: '振安区',
            c: '04'
          },
          {
            n: '宽甸满族自治县',
            c: '24'
          },
          {
            n: '东港市',
            c: '81'
          },
          {
            n: '凤城市',
            c: '82'
          }
        ]
      },
      {
        n: '锦州市',
        c: '07',
        city: [
          {
            n: '古塔区',
            c: '02'
          },
          {
            n: '凌河区',
            c: '03'
          },
          {
            n: '太和区',
            c: '11'
          },
          {
            n: '黑山县',
            c: '26'
          },
          {
            n: '义县',
            c: '27'
          },
          {
            n: '凌海市',
            c: '81'
          },
          {
            n: '北镇市',
            c: '82'
          }
        ]
      },
      {
        n: '营口市',
        c: '08',
        city: [
          {
            n: '站前区',
            c: '02'
          },
          {
            n: '西市区',
            c: '03'
          },
          {
            n: '鲅鱼圈区',
            c: '04'
          },
          {
            n: '老边区',
            c: '11'
          },
          {
            n: '盖州市',
            c: '81'
          },
          {
            n: '大石桥市',
            c: '82'
          }
        ]
      },
      {
        n: '阜新市',
        c: '09',
        city: [
          {
            n: '海州区',
            c: '02'
          },
          {
            n: '新邱区',
            c: '03'
          },
          {
            n: '太平区',
            c: '04'
          },
          {
            n: '清河门区',
            c: '05'
          },
          {
            n: '细河区',
            c: '11'
          },
          {
            n: '阜新蒙古族自治县',
            c: '21'
          },
          {
            n: '彰武县',
            c: '22'
          }
        ]
      },
      {
        n: '辽阳市',
        c: '10',
        city: [
          {
            n: '白塔区',
            c: '02'
          },
          {
            n: '文圣区',
            c: '03'
          },
          {
            n: '宏伟区',
            c: '04'
          },
          {
            n: '弓长岭区',
            c: '05'
          },
          {
            n: '太子河区',
            c: '11'
          },
          {
            n: '辽阳县',
            c: '21'
          },
          {
            n: '灯塔市',
            c: '81'
          }
        ]
      },
      {
        n: '盘锦市',
        c: '11',
        city: [
          {
            n: '双台子区',
            c: '02'
          },
          {
            n: '兴隆台区',
            c: '03'
          },
          {
            n: '大洼县',
            c: '21'
          },
          {
            n: '盘山县',
            c: '22'
          }
        ]
      },
      {
        n: '铁岭市',
        c: '12',
        city: [
          {
            n: '银州区',
            c: '02'
          },
          {
            n: '清河区',
            c: '04'
          },
          {
            n: '铁岭县',
            c: '21'
          },
          {
            n: '西丰县',
            c: '23'
          },
          {
            n: '昌图县',
            c: '24'
          },
          {
            n: '调兵山市',
            c: '81'
          },
          {
            n: '开原市',
            c: '82'
          }
        ]
      },
      {
        n: '朝阳市',
        c: '13',
        city: [
          {
            n: '双塔区',
            c: '02'
          },
          {
            n: '龙城区',
            c: '03'
          },
          {
            n: '朝阳县',
            c: '21'
          },
          {
            n: '建平县',
            c: '22'
          },
          {
            n: '喀喇沁左翼蒙古族自治县',
            c: '24'
          },
          {
            n: '北票市',
            c: '81'
          },
          {
            n: '凌源市',
            c: '82'
          }
        ]
      },
      {
        n: '葫芦岛市',
        c: '14',
        city: [
          {
            n: '连山区',
            c: '02'
          },
          {
            n: '龙港区',
            c: '03'
          },
          {
            n: '南票区',
            c: '04'
          },
          {
            n: '绥中县',
            c: '21'
          },
          {
            n: '建昌县',
            c: '22'
          },
          {
            n: '兴城市',
            c: '81'
          }
        ]
      }
    ]
  },
  {
    n: '吉林',
    c: '22',
    s: [
      {
        n: '长春市',
        c: '01',
        city: [
          {
            n: '南关区',
            c: '02'
          },
          {
            n: '宽城区',
            c: '03'
          },
          {
            n: '朝阳区',
            c: '04'
          },
          {
            n: '二道区',
            c: '05'
          },
          {
            n: '绿园区',
            c: '06'
          },
          {
            n: '双阳区',
            c: '12'
          },
          {
            n: '农安县',
            c: '22'
          },
          {
            n: '九台市',
            c: '81'
          },
          {
            n: '榆树市',
            c: '82'
          },
          {
            n: '德惠市',
            c: '83'
          }
        ]
      },
      {
        n: '吉林市',
        c: '02',
        city: [
          {
            n: '昌邑区',
            c: '02'
          },
          {
            n: '龙潭区',
            c: '03'
          },
          {
            n: '船营区',
            c: '04'
          },
          {
            n: '丰满区',
            c: '11'
          },
          {
            n: '永吉县',
            c: '21'
          },
          {
            n: '蛟河市',
            c: '81'
          },
          {
            n: '桦甸市',
            c: '82'
          },
          {
            n: '舒兰市',
            c: '83'
          },
          {
            n: '磐石市',
            c: '84'
          }
        ]
      },
      {
        n: '四平市',
        c: '03',
        city: [
          {
            n: '铁西区',
            c: '02'
          },
          {
            n: '铁东区',
            c: '03'
          },
          {
            n: '梨树县',
            c: '22'
          },
          {
            n: '伊通满族自治县',
            c: '23'
          },
          {
            n: '公主岭市',
            c: '81'
          },
          {
            n: '双辽市',
            c: '82'
          }
        ]
      },
      {
        n: '辽源市',
        c: '04',
        city: [
          {
            n: '龙山区',
            c: '02'
          },
          {
            n: '西安区',
            c: '03'
          },
          {
            n: '东丰县',
            c: '21'
          },
          {
            n: '东辽县',
            c: '22'
          }
        ]
      },
      {
        n: '通化市',
        c: '05',
        city: [
          {
            n: '东昌区',
            c: '02'
          },
          {
            n: '二道江区',
            c: '03'
          },
          {
            n: '通化县',
            c: '21'
          },
          {
            n: '辉南县',
            c: '23'
          },
          {
            n: '柳河县',
            c: '24'
          },
          {
            n: '梅河口市',
            c: '81'
          },
          {
            n: '集安市',
            c: '82'
          }
        ]
      },
      {
        n: '白山市',
        c: '06',
        city: [
          {
            n: '八道江区',
            c: '02'
          },
          {
            n: '江源区',
            c: '04'
          },
          {
            n: '抚松县',
            c: '21'
          },
          {
            n: '靖宇县',
            c: '22'
          },
          {
            n: '长白朝鲜族自治县',
            c: '23'
          },
          {
            n: '临江市',
            c: '81'
          }
        ]
      },
      {
        n: '松原市',
        c: '07',
        city: [
          {
            n: '宁江区',
            c: '02'
          },
          {
            n: '前郭尔罗斯蒙古族自治县',
            c: '21'
          },
          {
            n: '长岭县',
            c: '22'
          },
          {
            n: '乾安县',
            c: '23'
          },
          {
            n: '扶余县',
            c: '24'
          }
        ]
      },
      {
        n: '白城市',
        c: '08',
        city: [
          {
            n: '洮北区',
            c: '02'
          },
          {
            n: '镇赉县',
            c: '21'
          },
          {
            n: '通榆县',
            c: '22'
          },
          {
            n: '洮南市',
            c: '81'
          },
          {
            n: '大安市',
            c: '82'
          }
        ]
      },
      {
        n: '延边朝鲜族自治州',
        c: '24',
        city: [
          {
            n: '延吉市',
            c: '01'
          },
          {
            n: '图们市',
            c: '02'
          },
          {
            n: '敦化市',
            c: '03'
          },
          {
            n: '珲春市',
            c: '04'
          },
          {
            n: '龙井市',
            c: '05'
          },
          {
            n: '和龙市',
            c: '06'
          },
          {
            n: '汪清县',
            c: '24'
          },
          {
            n: '安图县',
            c: '26'
          }
        ]
      }
    ]
  },
  {
    n: '黑龙江',
    c: '23',
    s: [
      {
        n: '哈尔滨市',
        c: '01',
        city: [
          {
            n: '道里区',
            c: '02'
          },
          {
            n: '南岗区',
            c: '03'
          },
          {
            n: '道外区',
            c: '04'
          },
          {
            n: '平房区',
            c: '08'
          },
          {
            n: '松北区',
            c: '09'
          },
          {
            n: '香坊区',
            c: '10'
          },
          {
            n: '呼兰区',
            c: '11'
          },
          {
            n: '阿城区',
            c: '12'
          },
          {
            n: '依兰县',
            c: '23'
          },
          {
            n: '方正县',
            c: '24'
          },
          {
            n: '宾县',
            c: '25'
          },
          {
            n: '巴彦县',
            c: '26'
          },
          {
            n: '木兰县',
            c: '27'
          },
          {
            n: '通河县',
            c: '28'
          },
          {
            n: '延寿县',
            c: '29'
          },
          {
            n: '双城市',
            c: '82'
          },
          {
            n: '尚志市',
            c: '83'
          },
          {
            n: '五常市',
            c: '84'
          }
        ]
      },
      {
        n: '齐齐哈尔市',
        c: '02',
        city: [
          {
            n: '龙沙区',
            c: '02'
          },
          {
            n: '建华区',
            c: '03'
          },
          {
            n: '铁锋区',
            c: '04'
          },
          {
            n: '昂昂溪区',
            c: '05'
          },
          {
            n: '富拉尔基区',
            c: '06'
          },
          {
            n: '碾子山区',
            c: '07'
          },
          {
            n: '梅里斯达斡尔族区',
            c: '08'
          },
          {
            n: '龙江县',
            c: '21'
          },
          {
            n: '依安县',
            c: '23'
          },
          {
            n: '泰来县',
            c: '24'
          },
          {
            n: '甘南县',
            c: '25'
          },
          {
            n: '富裕县',
            c: '27'
          },
          {
            n: '克山县',
            c: '29'
          },
          {
            n: '克东县',
            c: '30'
          },
          {
            n: '拜泉县',
            c: '31'
          },
          {
            n: '讷河市',
            c: '81'
          }
        ]
      },
      {
        n: '鸡西市',
        c: '03',
        city: [
          {
            n: '鸡冠区',
            c: '02'
          },
          {
            n: '恒山区',
            c: '03'
          },
          {
            n: '滴道区',
            c: '04'
          },
          {
            n: '梨树区',
            c: '05'
          },
          {
            n: '城子河区',
            c: '06'
          },
          {
            n: '麻山区',
            c: '07'
          },
          {
            n: '鸡东县',
            c: '21'
          },
          {
            n: '虎林市',
            c: '81'
          },
          {
            n: '密山市',
            c: '82'
          }
        ]
      },
      {
        n: '鹤岗市',
        c: '04',
        city: [
          {
            n: '向阳区',
            c: '02'
          },
          {
            n: '工农区',
            c: '03'
          },
          {
            n: '南山区',
            c: '04'
          },
          {
            n: '兴安区',
            c: '05'
          },
          {
            n: '东山区',
            c: '06'
          },
          {
            n: '兴山区',
            c: '07'
          },
          {
            n: '萝北县',
            c: '21'
          },
          {
            n: '绥滨县',
            c: '22'
          }
        ]
      },
      {
        n: '双鸭山市',
        c: '05',
        city: [
          {
            n: '尖山区',
            c: '02'
          },
          {
            n: '岭东区',
            c: '03'
          },
          {
            n: '四方台区',
            c: '05'
          },
          {
            n: '宝山区',
            c: '06'
          },
          {
            n: '集贤县',
            c: '21'
          },
          {
            n: '友谊县',
            c: '22'
          },
          {
            n: '宝清县',
            c: '23'
          },
          {
            n: '饶河县',
            c: '24'
          }
        ]
      },
      {
        n: '大庆市',
        c: '06',
        city: [
          {
            n: '萨尔图区',
            c: '02'
          },
          {
            n: '龙凤区',
            c: '03'
          },
          {
            n: '让胡路区',
            c: '04'
          },
          {
            n: '红岗区',
            c: '05'
          },
          {
            n: '大同区',
            c: '06'
          },
          {
            n: '肇州县',
            c: '21'
          },
          {
            n: '肇源县',
            c: '22'
          },
          {
            n: '林甸县',
            c: '23'
          },
          {
            n: '杜尔伯特蒙古族自治县',
            c: '24'
          }
        ]
      },
      {
        n: '伊春市',
        c: '07',
        city: [
          {
            n: '伊春区',
            c: '02'
          },
          {
            n: '南岔区',
            c: '03'
          },
          {
            n: '友好区',
            c: '04'
          },
          {
            n: '西林区',
            c: '05'
          },
          {
            n: '翠峦区',
            c: '06'
          },
          {
            n: '新青区',
            c: '07'
          },
          {
            n: '美溪区',
            c: '08'
          },
          {
            n: '金山屯区',
            c: '09'
          },
          {
            n: '五营区',
            c: '10'
          },
          {
            n: '乌马河区',
            c: '11'
          },
          {
            n: '汤旺河区',
            c: '12'
          },
          {
            n: '带岭区',
            c: '13'
          },
          {
            n: '乌伊岭区',
            c: '14'
          },
          {
            n: '红星区',
            c: '15'
          },
          {
            n: '上甘岭区',
            c: '16'
          },
          {
            n: '嘉荫县',
            c: '22'
          },
          {
            n: '铁力市',
            c: '81'
          }
        ]
      },
      {
        n: '佳木斯市',
        c: '08',
        city: [
          {
            n: '向阳区',
            c: '03'
          },
          {
            n: '前进区',
            c: '04'
          },
          {
            n: '东风区',
            c: '05'
          },
          {
            n: '郊区',
            c: '11'
          },
          {
            n: '桦南县',
            c: '22'
          },
          {
            n: '桦川县',
            c: '26'
          },
          {
            n: '汤原县',
            c: '28'
          },
          {
            n: '抚远县',
            c: '33'
          },
          {
            n: '同江市',
            c: '81'
          },
          {
            n: '富锦市',
            c: '82'
          }
        ]
      },
      {
        n: '七台河市',
        c: '09',
        city: [
          {
            n: '新兴区',
            c: '02'
          },
          {
            n: '桃山区',
            c: '03'
          },
          {
            n: '茄子河区',
            c: '04'
          },
          {
            n: '勃利县',
            c: '21'
          }
        ]
      },
      {
        n: '牡丹江市',
        c: '10',
        city: [
          {
            n: '东安区',
            c: '02'
          },
          {
            n: '阳明区',
            c: '03'
          },
          {
            n: '爱民区',
            c: '04'
          },
          {
            n: '西安区',
            c: '05'
          },
          {
            n: '东宁县',
            c: '24'
          },
          {
            n: '林口县',
            c: '25'
          },
          {
            n: '绥芬河市',
            c: '81'
          },
          {
            n: '海林市',
            c: '83'
          },
          {
            n: '宁安市',
            c: '84'
          },
          {
            n: '穆棱市',
            c: '85'
          }
        ]
      },
      {
        n: '黑河市',
        c: '11',
        city: [
          {
            n: '爱辉区',
            c: '02'
          },
          {
            n: '嫩江县',
            c: '21'
          },
          {
            n: '逊克县',
            c: '23'
          },
          {
            n: '孙吴县',
            c: '24'
          },
          {
            n: '北安市',
            c: '81'
          },
          {
            n: '五大连池市',
            c: '82'
          }
        ]
      },
      {
        n: '绥化市',
        c: '12',
        city: [
          {
            n: '北林区',
            c: '02'
          },
          {
            n: '望奎县',
            c: '21'
          },
          {
            n: '兰西县',
            c: '22'
          },
          {
            n: '青冈县',
            c: '23'
          },
          {
            n: '庆安县',
            c: '24'
          },
          {
            n: '明水县',
            c: '25'
          },
          {
            n: '绥棱县',
            c: '26'
          },
          {
            n: '安达市',
            c: '81'
          },
          {
            n: '肇东市',
            c: '82'
          },
          {
            n: '海伦市',
            c: '83'
          }
        ]
      },
      {
        n: '大兴安岭地区',
        c: '27',
        city: [
          {
            n: '加格达奇区',
            c: '01'
          },
          {
            n: '松岭区',
            c: '02'
          },
          {
            n: '新林区',
            c: '03'
          },
          {
            n: '呼中区',
            c: '04'
          },
          {
            n: '呼玛县',
            c: '21'
          },
          {
            n: '塔河县',
            c: '22'
          },
          {
            n: '漠河县',
            c: '23'
          }
        ]
      }
    ]
  },
  {
    n: '上海',
    c: '31',
    s: {
      n: '上海',
      c: '01',
      city: [
        {
          n: '黄浦区',
          c: '01'
        },
        {
          n: '卢湾区',
          c: '03'
        },
        {
          n: '徐汇区',
          c: '04'
        },
        {
          n: '长宁区',
          c: '05'
        },
        {
          n: '静安区',
          c: '06'
        },
        {
          n: '普陀区',
          c: '07'
        },
        {
          n: '闸北区',
          c: '08'
        },
        {
          n: '虹口区',
          c: '09'
        },
        {
          n: '杨浦区',
          c: '10'
        },
        {
          n: '闵行区',
          c: '12'
        },
        {
          n: '宝山区',
          c: '13'
        },
        {
          n: '嘉定区',
          c: '14'
        },
        {
          n: '浦东新区',
          c: '15'
        },
        {
          n: '金山区',
          c: '16'
        },
        {
          n: '松江区',
          c: '17'
        },
        {
          n: '青浦区',
          c: '18'
        },
        {
          n: '南汇区',
          c: '19'
        },
        {
          n: '奉贤区',
          c: '20'
        },
        {
          n: '崇明县',
          c: '30'
        }
      ]
    }
  },
  {
    n: '江苏',
    c: '32',
    s: [
      {
        n: '南京市',
        c: '01',
        city: [
          {
            n: '玄武区',
            c: '02'
          },
          {
            n: '白下区',
            c: '03'
          },
          {
            n: '秦淮区',
            c: '04'
          },
          {
            n: '建邺区',
            c: '05'
          },
          {
            n: '鼓楼区',
            c: '06'
          },
          {
            n: '下关区',
            c: '07'
          },
          {
            n: '浦口区',
            c: '11'
          },
          {
            n: '栖霞区',
            c: '13'
          },
          {
            n: '雨花台区',
            c: '14'
          },
          {
            n: '江宁区',
            c: '15'
          },
          {
            n: '六合区',
            c: '16'
          },
          {
            n: '溧水县',
            c: '24'
          },
          {
            n: '高淳县',
            c: '25'
          }
        ]
      },
      {
        n: '无锡市',
        c: '02',
        city: [
          {
            n: '崇安区',
            c: '02'
          },
          {
            n: '南长区',
            c: '03'
          },
          {
            n: '北塘区',
            c: '04'
          },
          {
            n: '锡山区',
            c: '05'
          },
          {
            n: '惠山区',
            c: '06'
          },
          {
            n: '滨湖区',
            c: '11'
          },
          {
            n: '江阴市',
            c: '81'
          },
          {
            n: '宜兴市',
            c: '82'
          }
        ]
      },
      {
        n: '徐州市',
        c: '03',
        city: [
          {
            n: '鼓楼区',
            c: '02'
          },
          {
            n: '云龙区',
            c: '03'
          },
          {
            n: '九里区',
            c: '04'
          },
          {
            n: '贾汪区',
            c: '05'
          },
          {
            n: '泉山区',
            c: '11'
          },
          {
            n: '丰县',
            c: '21'
          },
          {
            n: '沛县',
            c: '22'
          },
          {
            n: '铜山县',
            c: '23'
          },
          {
            n: '睢宁县',
            c: '24'
          },
          {
            n: '新沂市',
            c: '81'
          },
          {
            n: '邳州市',
            c: '82'
          }
        ]
      },
      {
        n: '常州市',
        c: '04',
        city: [
          {
            n: '天宁区',
            c: '02'
          },
          {
            n: '钟楼区',
            c: '04'
          },
          {
            n: '戚墅堰区',
            c: '05'
          },
          {
            n: '新北区',
            c: '11'
          },
          {
            n: '武进区',
            c: '12'
          },
          {
            n: '溧阳市',
            c: '81'
          },
          {
            n: '金坛市',
            c: '82'
          }
        ]
      },
      {
        n: '苏州市',
        c: '05',
        city: [
          {
            n: '沧浪区',
            c: '02'
          },
          {
            n: '平江区',
            c: '03'
          },
          {
            n: '金阊区',
            c: '04'
          },
          {
            n: '虎丘区',
            c: '05'
          },
          {
            n: '吴中区',
            c: '06'
          },
          {
            n: '相城区',
            c: '07'
          },
          {
            n: '常熟市',
            c: '81'
          },
          {
            n: '张家港市',
            c: '82'
          },
          {
            n: '昆山市',
            c: '83'
          },
          {
            n: '吴江市',
            c: '84'
          },
          {
            n: '太仓市',
            c: '85'
          }
        ]
      },
      {
        n: '南通市',
        c: '06',
        city: [
          {
            n: '崇川区',
            c: '02'
          },
          {
            n: '港闸区',
            c: '11'
          },
          {
            n: '海安县',
            c: '21'
          },
          {
            n: '如东县',
            c: '23'
          },
          {
            n: '启东市',
            c: '81'
          },
          {
            n: '如皋市',
            c: '82'
          },
          {
            n: '通州市',
            c: '83'
          },
          {
            n: '海门市',
            c: '84'
          }
        ]
      },
      {
        n: '连云港市',
        c: '07',
        city: [
          {
            n: '连云区',
            c: '03'
          },
          {
            n: '新浦区',
            c: '05'
          },
          {
            n: '海州区',
            c: '06'
          },
          {
            n: '赣榆县',
            c: '21'
          },
          {
            n: '东海县',
            c: '22'
          },
          {
            n: '灌云县',
            c: '23'
          },
          {
            n: '灌南县',
            c: '24'
          }
        ]
      },
      {
        n: '淮安市',
        c: '08',
        city: [
          {
            n: '清河区',
            c: '02'
          },
          {
            n: '楚州区',
            c: '03'
          },
          {
            n: '淮阴区',
            c: '04'
          },
          {
            n: '清浦区',
            c: '11'
          },
          {
            n: '涟水县',
            c: '26'
          },
          {
            n: '洪泽县',
            c: '29'
          },
          {
            n: '盱眙县',
            c: '30'
          },
          {
            n: '金湖县',
            c: '31'
          }
        ]
      },
      {
        n: '盐城市',
        c: '09',
        city: [
          {
            n: '亭湖区',
            c: '02'
          },
          {
            n: '盐都区',
            c: '03'
          },
          {
            n: '响水县',
            c: '21'
          },
          {
            n: '滨海县',
            c: '22'
          },
          {
            n: '阜宁县',
            c: '23'
          },
          {
            n: '射阳县',
            c: '24'
          },
          {
            n: '建湖县',
            c: '25'
          },
          {
            n: '东台市',
            c: '81'
          },
          {
            n: '大丰市',
            c: '82'
          }
        ]
      },
      {
        n: '扬州市',
        c: '10',
        city: [
          {
            n: '广陵区',
            c: '02'
          },
          {
            n: '邗江区',
            c: '03'
          },
          {
            n: '维扬区',
            c: '11'
          },
          {
            n: '宝应县',
            c: '23'
          },
          {
            n: '仪征市',
            c: '81'
          },
          {
            n: '高邮市',
            c: '84'
          },
          {
            n: '江都市',
            c: '88'
          }
        ]
      },
      {
        n: '镇江市',
        c: '11',
        city: [
          {
            n: '京口区',
            c: '02'
          },
          {
            n: '润州区',
            c: '11'
          },
          {
            n: '丹徒区',
            c: '12'
          },
          {
            n: '丹阳市',
            c: '81'
          },
          {
            n: '扬中市',
            c: '82'
          },
          {
            n: '句容市',
            c: '83'
          }
        ]
      },
      {
        n: '泰州市',
        c: '12',
        city: [
          {
            n: '海陵区',
            c: '02'
          },
          {
            n: '高港区',
            c: '03'
          },
          {
            n: '兴化市',
            c: '81'
          },
          {
            n: '靖江市',
            c: '82'
          },
          {
            n: '泰兴市',
            c: '83'
          },
          {
            n: '姜堰市',
            c: '84'
          }
        ]
      },
      {
        n: '宿迁市',
        c: '13',
        city: [
          {
            n: '宿城区',
            c: '02'
          },
          {
            n: '宿豫区',
            c: '11'
          },
          {
            n: '沭阳县',
            c: '22'
          },
          {
            n: '泗阳县',
            c: '23'
          },
          {
            n: '泗洪县',
            c: '24'
          }
        ]
      }
    ]
  },
  {
    n: '浙江',
    c: '33',
    s: [
      {
        n: '杭州市',
        c: '01',
        city: [
          {
            n: '上城区',
            c: '02'
          },
          {
            n: '下城区',
            c: '03'
          },
          {
            n: '江干区',
            c: '04'
          },
          {
            n: '拱墅区',
            c: '05'
          },
          {
            n: '西湖区',
            c: '06'
          },
          {
            n: '滨江区',
            c: '08'
          },
          {
            n: '萧山区',
            c: '09'
          },
          {
            n: '余杭区',
            c: '10'
          },
          {
            n: '桐庐县',
            c: '22'
          },
          {
            n: '淳安县',
            c: '27'
          },
          {
            n: '建德市',
            c: '82'
          },
          {
            n: '富阳市',
            c: '83'
          },
          {
            n: '临安市',
            c: '85'
          }
        ]
      },
      {
        n: '宁波市',
        c: '02',
        city: [
          {
            n: '海曙区',
            c: '03'
          },
          {
            n: '江东区',
            c: '04'
          },
          {
            n: '江北区',
            c: '05'
          },
          {
            n: '北仑区',
            c: '06'
          },
          {
            n: '镇海区',
            c: '11'
          },
          {
            n: '鄞州区',
            c: '12'
          },
          {
            n: '象山县',
            c: '25'
          },
          {
            n: '宁海县',
            c: '26'
          },
          {
            n: '余姚市',
            c: '81'
          },
          {
            n: '慈溪市',
            c: '82'
          },
          {
            n: '奉化市',
            c: '83'
          }
        ]
      },
      {
        n: '温州市',
        c: '03',
        city: [
          {
            n: '鹿城区',
            c: '02'
          },
          {
            n: '龙湾区',
            c: '03'
          },
          {
            n: '瓯海区',
            c: '04'
          },
          {
            n: '洞头县',
            c: '22'
          },
          {
            n: '永嘉县',
            c: '24'
          },
          {
            n: '平阳县',
            c: '26'
          },
          {
            n: '苍南县',
            c: '27'
          },
          {
            n: '文成县',
            c: '28'
          },
          {
            n: '泰顺县',
            c: '29'
          },
          {
            n: '瑞安市',
            c: '81'
          },
          {
            n: '乐清市',
            c: '82'
          }
        ]
      },
      {
        n: '嘉兴市',
        c: '04',
        city: [
          {
            n: '秀城区',
            c: '02'
          },
          {
            n: '秀洲区',
            c: '11'
          },
          {
            n: '嘉善县',
            c: '21'
          },
          {
            n: '海盐县',
            c: '24'
          },
          {
            n: '海宁市',
            c: '81'
          },
          {
            n: '平湖市',
            c: '82'
          },
          {
            n: '桐乡市',
            c: '83'
          }
        ]
      },
      {
        n: '湖州市',
        c: '05',
        city: [
          {
            n: '吴兴区',
            c: '02'
          },
          {
            n: '南浔区',
            c: '03'
          },
          {
            n: '德清县',
            c: '21'
          },
          {
            n: '长兴县',
            c: '22'
          },
          {
            n: '安吉县',
            c: '23'
          }
        ]
      },
      {
        n: '绍兴市',
        c: '06',
        city: [
          {
            n: '越城区',
            c: '02'
          },
          {
            n: '绍兴县',
            c: '21'
          },
          {
            n: '新昌县',
            c: '24'
          },
          {
            n: '诸暨市',
            c: '81'
          },
          {
            n: '上虞市',
            c: '82'
          },
          {
            n: '嵊州市',
            c: '83'
          }
        ]
      },
      {
        n: '金华市',
        c: '07',
        city: [
          {
            n: '婺城区',
            c: '02'
          },
          {
            n: '金东区',
            c: '03'
          },
          {
            n: '武义县',
            c: '23'
          },
          {
            n: '浦江县',
            c: '26'
          },
          {
            n: '磐安县',
            c: '27'
          },
          {
            n: '兰溪市',
            c: '81'
          },
          {
            n: '义乌市',
            c: '82'
          },
          {
            n: '东阳市',
            c: '83'
          },
          {
            n: '永康市',
            c: '84'
          }
        ]
      },
      {
        n: '衢州市',
        c: '08',
        city: [
          {
            n: '柯城区',
            c: '02'
          },
          {
            n: '衢江区',
            c: '03'
          },
          {
            n: '常山县',
            c: '22'
          },
          {
            n: '开化县',
            c: '24'
          },
          {
            n: '龙游县',
            c: '25'
          },
          {
            n: '江山市',
            c: '81'
          }
        ]
      },
      {
        n: '舟山市',
        c: '09',
        city: [
          {
            n: '定海区',
            c: '02'
          },
          {
            n: '普陀区',
            c: '03'
          },
          {
            n: '岱山县',
            c: '21'
          },
          {
            n: '嵊泗县',
            c: '22'
          }
        ]
      },
      {
        n: '台州市',
        c: '10',
        city: [
          {
            n: '椒江区',
            c: '02'
          },
          {
            n: '黄岩区',
            c: '03'
          },
          {
            n: '路桥区',
            c: '04'
          },
          {
            n: '玉环县',
            c: '21'
          },
          {
            n: '三门县',
            c: '22'
          },
          {
            n: '天台县',
            c: '23'
          },
          {
            n: '仙居县',
            c: '24'
          },
          {
            n: '温岭市',
            c: '81'
          },
          {
            n: '临海市',
            c: '82'
          }
        ]
      },
      {
        n: '丽水市',
        c: '11',
        city: [
          {
            n: '莲都区',
            c: '02'
          },
          {
            n: '青田县',
            c: '21'
          },
          {
            n: '缙云县',
            c: '22'
          },
          {
            n: '遂昌县',
            c: '23'
          },
          {
            n: '松阳县',
            c: '24'
          },
          {
            n: '云和县',
            c: '25'
          },
          {
            n: '庆元县',
            c: '26'
          },
          {
            n: '景宁畲族自治县',
            c: '27'
          },
          {
            n: '龙泉市',
            c: '81'
          }
        ]
      }
    ]
  },
  {
    n: '安徽',
    c: '34',
    s: [
      {
        n: '合肥市',
        c: '01',
        city: [
          {
            n: '瑶海区',
            c: '02'
          },
          {
            n: '庐阳区',
            c: '03'
          },
          {
            n: '蜀山区',
            c: '04'
          },
          {
            n: '包河区',
            c: '11'
          },
          {
            n: '长丰县',
            c: '21'
          },
          {
            n: '肥东县',
            c: '22'
          },
          {
            n: '肥西县',
            c: '23'
          }
        ]
      },
      {
        n: '芜湖市',
        c: '02',
        city: [
          {
            n: '镜湖区',
            c: '02'
          },
          {
            n: '弋江区',
            c: '03'
          },
          {
            n: '鸠江区',
            c: '07'
          },
          {
            n: '三山区',
            c: '08'
          },
          {
            n: '芜湖县',
            c: '21'
          },
          {
            n: '繁昌县',
            c: '22'
          },
          {
            n: '南陵县',
            c: '23'
          }
        ]
      },
      {
        n: '蚌埠市',
        c: '03',
        city: [
          {
            n: '龙子湖区',
            c: '02'
          },
          {
            n: '蚌山区',
            c: '03'
          },
          {
            n: '禹会区',
            c: '04'
          },
          {
            n: '淮上区',
            c: '11'
          },
          {
            n: '怀远县',
            c: '21'
          },
          {
            n: '五河县',
            c: '22'
          },
          {
            n: '固镇县',
            c: '23'
          }
        ]
      },
      {
        n: '淮南市',
        c: '04',
        city: [
          {
            n: '大通区',
            c: '02'
          },
          {
            n: '田家庵区',
            c: '03'
          },
          {
            n: '谢家集区',
            c: '04'
          },
          {
            n: '八公山区',
            c: '05'
          },
          {
            n: '潘集区',
            c: '06'
          },
          {
            n: '凤台县',
            c: '21'
          }
        ]
      },
      {
        n: '马鞍山市',
        c: '05',
        city: [
          {
            n: '金家庄区',
            c: '02'
          },
          {
            n: '花山区',
            c: '03'
          },
          {
            n: '雨山区',
            c: '04'
          },
          {
            n: '当涂县',
            c: '21'
          }
        ]
      },
      {
        n: '淮北市',
        c: '06',
        city: [
          {
            n: '杜集区',
            c: '02'
          },
          {
            n: '相山区',
            c: '03'
          },
          {
            n: '烈山区',
            c: '04'
          },
          {
            n: '濉溪县',
            c: '21'
          }
        ]
      },
      {
        n: '铜陵市',
        c: '07',
        city: [
          {
            n: '铜官山区',
            c: '02'
          },
          {
            n: '狮子山区',
            c: '03'
          },
          {
            n: '郊区',
            c: '11'
          },
          {
            n: '铜陵县',
            c: '21'
          }
        ]
      },
      {
        n: '安庆市',
        c: '08',
        city: [
          {
            n: '迎江区',
            c: '02'
          },
          {
            n: '大观区',
            c: '03'
          },
          {
            n: '宜秀区',
            c: '11'
          },
          {
            n: '怀宁县',
            c: '22'
          },
          {
            n: '枞阳县',
            c: '23'
          },
          {
            n: '潜山县',
            c: '24'
          },
          {
            n: '太湖县',
            c: '25'
          },
          {
            n: '宿松县',
            c: '26'
          },
          {
            n: '望江县',
            c: '27'
          },
          {
            n: '岳西县',
            c: '28'
          },
          {
            n: '桐城市',
            c: '81'
          }
        ]
      },
      {
        n: '黄山市',
        c: '10',
        city: [
          {
            n: '屯溪区',
            c: '02'
          },
          {
            n: '黄山区',
            c: '03'
          },
          {
            n: '徽州区',
            c: '04'
          },
          {
            n: '歙县',
            c: '21'
          },
          {
            n: '休宁县',
            c: '22'
          },
          {
            n: '黟县',
            c: '23'
          },
          {
            n: '祁门县',
            c: '24'
          }
        ]
      },
      {
        n: '滁州市',
        c: '11',
        city: [
          {
            n: '琅琊区',
            c: '02'
          },
          {
            n: '南谯区',
            c: '03'
          },
          {
            n: '来安县',
            c: '22'
          },
          {
            n: '全椒县',
            c: '24'
          },
          {
            n: '定远县',
            c: '25'
          },
          {
            n: '凤阳县',
            c: '26'
          },
          {
            n: '天长市',
            c: '81'
          },
          {
            n: '明光市',
            c: '82'
          }
        ]
      },
      {
        n: '阜阳市',
        c: '12',
        city: [
          {
            n: '颍州区',
            c: '02'
          },
          {
            n: '颍东区',
            c: '03'
          },
          {
            n: '颍泉区',
            c: '04'
          },
          {
            n: '临泉县',
            c: '21'
          },
          {
            n: '太和县',
            c: '22'
          },
          {
            n: '阜南县',
            c: '25'
          },
          {
            n: '颍上县',
            c: '26'
          },
          {
            n: '界首市',
            c: '82'
          }
        ]
      },
      {
        n: '宿州市',
        c: '13',
        city: [
          {
            n: '埇桥区',
            c: '02'
          },
          {
            n: '砀山县',
            c: '21'
          },
          {
            n: '萧县',
            c: '22'
          },
          {
            n: '灵璧县',
            c: '23'
          },
          {
            n: '泗县',
            c: '24'
          }
        ]
      },
      {
        n: '巢湖市',
        c: '14',
        city: [
          {
            n: '居巢区',
            c: '02'
          },
          {
            n: '庐江县',
            c: '21'
          },
          {
            n: '无为县',
            c: '22'
          },
          {
            n: '含山县',
            c: '23'
          },
          {
            n: '和县',
            c: '24'
          }
        ]
      },
      {
        n: '六安市',
        c: '15',
        city: [
          {
            n: '金安区',
            c: '02'
          },
          {
            n: '裕安区',
            c: '03'
          },
          {
            n: '寿县',
            c: '21'
          },
          {
            n: '霍邱县',
            c: '22'
          },
          {
            n: '舒城县',
            c: '23'
          },
          {
            n: '金寨县',
            c: '24'
          },
          {
            n: '霍山县',
            c: '25'
          }
        ]
      },
      {
        n: '亳州市',
        c: '16',
        city: [
          {
            n: '谯城区',
            c: '02'
          },
          {
            n: '涡阳县',
            c: '21'
          },
          {
            n: '蒙城县',
            c: '22'
          },
          {
            n: '利辛县',
            c: '23'
          }
        ]
      },
      {
        n: '池州市',
        c: '17',
        city: [
          {
            n: '贵池区',
            c: '02'
          },
          {
            n: '东至县',
            c: '21'
          },
          {
            n: '石台县',
            c: '22'
          },
          {
            n: '青阳县',
            c: '23'
          }
        ]
      },
      {
        n: '宣城市',
        c: '18',
        city: [
          {
            n: '宣州区',
            c: '02'
          },
          {
            n: '郎溪县',
            c: '21'
          },
          {
            n: '广德县',
            c: '22'
          },
          {
            n: '泾县',
            c: '23'
          },
          {
            n: '绩溪县',
            c: '24'
          },
          {
            n: '旌德县',
            c: '25'
          },
          {
            n: '宁国市',
            c: '81'
          }
        ]
      }
    ]
  },
  {
    n: '福建',
    c: '35',
    s: [
      {
        n: '福州市',
        c: '01',
        city: [
          {
            n: '鼓楼区',
            c: '02'
          },
          {
            n: '台江区',
            c: '03'
          },
          {
            n: '仓山区',
            c: '04'
          },
          {
            n: '马尾区',
            c: '05'
          },
          {
            n: '晋安区',
            c: '11'
          },
          {
            n: '闽侯县',
            c: '21'
          },
          {
            n: '连江县',
            c: '22'
          },
          {
            n: '罗源县',
            c: '23'
          },
          {
            n: '闽清县',
            c: '24'
          },
          {
            n: '永泰县',
            c: '25'
          },
          {
            n: '平潭县',
            c: '28'
          },
          {
            n: '福清市',
            c: '81'
          },
          {
            n: '长乐市',
            c: '82'
          }
        ]
      },
      {
        n: '厦门市',
        c: '02',
        city: [
          {
            n: '思明区',
            c: '03'
          },
          {
            n: '海沧区',
            c: '05'
          },
          {
            n: '湖里区',
            c: '06'
          },
          {
            n: '集美区',
            c: '11'
          },
          {
            n: '同安区',
            c: '12'
          },
          {
            n: '翔安区',
            c: '13'
          }
        ]
      },
      {
        n: '莆田市',
        c: '03',
        city: [
          {
            n: '城厢区',
            c: '02'
          },
          {
            n: '涵江区',
            c: '03'
          },
          {
            n: '荔城区',
            c: '04'
          },
          {
            n: '秀屿区',
            c: '05'
          },
          {
            n: '仙游县',
            c: '22'
          }
        ]
      },
      {
        n: '三明市',
        c: '04',
        city: [
          {
            n: '梅列区',
            c: '02'
          },
          {
            n: '三元区',
            c: '03'
          },
          {
            n: '明溪县',
            c: '21'
          },
          {
            n: '清流县',
            c: '23'
          },
          {
            n: '宁化县',
            c: '24'
          },
          {
            n: '大田县',
            c: '25'
          },
          {
            n: '尤溪县',
            c: '26'
          },
          {
            n: '沙县',
            c: '27'
          },
          {
            n: '将乐县',
            c: '28'
          },
          {
            n: '泰宁县',
            c: '29'
          },
          {
            n: '建宁县',
            c: '30'
          },
          {
            n: '永安市',
            c: '81'
          }
        ]
      },
      {
        n: '泉州市',
        c: '05',
        city: [
          {
            n: '鲤城区',
            c: '02'
          },
          {
            n: '丰泽区',
            c: '03'
          },
          {
            n: '洛江区',
            c: '04'
          },
          {
            n: '泉港区',
            c: '05'
          },
          {
            n: '惠安县',
            c: '21'
          },
          {
            n: '安溪县',
            c: '24'
          },
          {
            n: '永春县',
            c: '25'
          },
          {
            n: '德化县',
            c: '26'
          },
          {
            n: '金门县',
            c: '27'
          },
          {
            n: '石狮市',
            c: '81'
          },
          {
            n: '晋江市',
            c: '82'
          },
          {
            n: '南安市',
            c: '83'
          }
        ]
      },
      {
        n: '漳州市',
        c: '06',
        city: [
          {
            n: '芗城区',
            c: '02'
          },
          {
            n: '龙文区',
            c: '03'
          },
          {
            n: '云霄县',
            c: '22'
          },
          {
            n: '漳浦县',
            c: '23'
          },
          {
            n: '诏安县',
            c: '24'
          },
          {
            n: '长泰县',
            c: '25'
          },
          {
            n: '东山县',
            c: '26'
          },
          {
            n: '南靖县',
            c: '27'
          },
          {
            n: '平和县',
            c: '28'
          },
          {
            n: '华安县',
            c: '29'
          },
          {
            n: '龙海市',
            c: '81'
          }
        ]
      },
      {
        n: '南平市',
        c: '07',
        city: [
          {
            n: '延平区',
            c: '02'
          },
          {
            n: '顺昌县',
            c: '21'
          },
          {
            n: '浦城县',
            c: '22'
          },
          {
            n: '光泽县',
            c: '23'
          },
          {
            n: '松溪县',
            c: '24'
          },
          {
            n: '政和县',
            c: '25'
          },
          {
            n: '邵武市',
            c: '81'
          },
          {
            n: '武夷山市',
            c: '82'
          },
          {
            n: '建瓯市',
            c: '83'
          },
          {
            n: '建阳市',
            c: '84'
          }
        ]
      },
      {
        n: '龙岩市',
        c: '08',
        city: [
          {
            n: '新罗区',
            c: '02'
          },
          {
            n: '长汀县',
            c: '21'
          },
          {
            n: '永定县',
            c: '22'
          },
          {
            n: '上杭县',
            c: '23'
          },
          {
            n: '武平县',
            c: '24'
          },
          {
            n: '连城县',
            c: '25'
          },
          {
            n: '漳平市',
            c: '81'
          }
        ]
      },
      {
        n: '宁德市',
        c: '09',
        city: [
          {
            n: '蕉城区',
            c: '02'
          },
          {
            n: '霞浦县',
            c: '21'
          },
          {
            n: '古田县',
            c: '22'
          },
          {
            n: '屏南县',
            c: '23'
          },
          {
            n: '寿宁县',
            c: '24'
          },
          {
            n: '周宁县',
            c: '25'
          },
          {
            n: '柘荣县',
            c: '26'
          },
          {
            n: '福安市',
            c: '81'
          },
          {
            n: '福鼎市',
            c: '82'
          }
        ]
      }
    ]
  },
  {
    n: '江西',
    c: '36',
    s: [
      {
        n: '南昌市',
        c: '01',
        city: [
          {
            n: '东湖区',
            c: '02'
          },
          {
            n: '西湖区',
            c: '03'
          },
          {
            n: '青云谱区',
            c: '04'
          },
          {
            n: '湾里区',
            c: '05'
          },
          {
            n: '青山湖区',
            c: '11'
          },
          {
            n: '南昌县',
            c: '21'
          },
          {
            n: '新建县',
            c: '22'
          },
          {
            n: '安义县',
            c: '23'
          },
          {
            n: '进贤县',
            c: '24'
          }
        ]
      },
      {
        n: '景德镇市',
        c: '02',
        city: [
          {
            n: '昌江区',
            c: '02'
          },
          {
            n: '珠山区',
            c: '03'
          },
          {
            n: '浮梁县',
            c: '22'
          },
          {
            n: '乐平市',
            c: '81'
          }
        ]
      },
      {
        n: '萍乡市',
        c: '03',
        city: [
          {
            n: '安源区',
            c: '02'
          },
          {
            n: '湘东区',
            c: '13'
          },
          {
            n: '莲花县',
            c: '21'
          },
          {
            n: '上栗县',
            c: '22'
          },
          {
            n: '芦溪县',
            c: '23'
          }
        ]
      },
      {
        n: '九江市',
        c: '04',
        city: [
          {
            n: '庐山区',
            c: '02'
          },
          {
            n: '浔阳区',
            c: '03'
          },
          {
            n: '九江县',
            c: '21'
          },
          {
            n: '武宁县',
            c: '23'
          },
          {
            n: '修水县',
            c: '24'
          },
          {
            n: '永修县',
            c: '25'
          },
          {
            n: '德安县',
            c: '26'
          },
          {
            n: '星子县',
            c: '27'
          },
          {
            n: '都昌县',
            c: '28'
          },
          {
            n: '湖口县',
            c: '29'
          },
          {
            n: '彭泽县',
            c: '30'
          },
          {
            n: '瑞昌市',
            c: '81'
          }
        ]
      },
      {
        n: '新余市',
        c: '05',
        city: [
          {
            n: '渝水区',
            c: '02'
          },
          {
            n: '分宜县',
            c: '21'
          }
        ]
      },
      {
        n: '鹰潭市',
        c: '06',
        city: [
          {
            n: '月湖区',
            c: '02'
          },
          {
            n: '余江县',
            c: '22'
          },
          {
            n: '贵溪市',
            c: '81'
          }
        ]
      },
      {
        n: '赣州市',
        c: '07',
        city: [
          {
            n: '章贡区',
            c: '02'
          },
          {
            n: '赣县',
            c: '21'
          },
          {
            n: '信丰县',
            c: '22'
          },
          {
            n: '大余县',
            c: '23'
          },
          {
            n: '上犹县',
            c: '24'
          },
          {
            n: '崇义县',
            c: '25'
          },
          {
            n: '安远县',
            c: '26'
          },
          {
            n: '龙南县',
            c: '27'
          },
          {
            n: '定南县',
            c: '28'
          },
          {
            n: '全南县',
            c: '29'
          },
          {
            n: '宁都县',
            c: '30'
          },
          {
            n: '于都县',
            c: '31'
          },
          {
            n: '兴国县',
            c: '32'
          },
          {
            n: '会昌县',
            c: '33'
          },
          {
            n: '寻乌县',
            c: '34'
          },
          {
            n: '石城县',
            c: '35'
          },
          {
            n: '瑞金市',
            c: '81'
          },
          {
            n: '南康市',
            c: '82'
          }
        ]
      },
      {
        n: '吉安市',
        c: '08',
        city: [
          {
            n: '吉州区',
            c: '02'
          },
          {
            n: '青原区',
            c: '03'
          },
          {
            n: '吉安县',
            c: '21'
          },
          {
            n: '吉水县',
            c: '22'
          },
          {
            n: '峡江县',
            c: '23'
          },
          {
            n: '新干县',
            c: '24'
          },
          {
            n: '永丰县',
            c: '25'
          },
          {
            n: '泰和县',
            c: '26'
          },
          {
            n: '遂川县',
            c: '27'
          },
          {
            n: '万安县',
            c: '28'
          },
          {
            n: '安福县',
            c: '29'
          },
          {
            n: '永新县',
            c: '30'
          },
          {
            n: '井冈山市',
            c: '81'
          }
        ]
      },
      {
        n: '宜春市',
        c: '09',
        city: [
          {
            n: '袁州区',
            c: '02'
          },
          {
            n: '奉新县',
            c: '21'
          },
          {
            n: '万载县',
            c: '22'
          },
          {
            n: '上高县',
            c: '23'
          },
          {
            n: '宜丰县',
            c: '24'
          },
          {
            n: '靖安县',
            c: '25'
          },
          {
            n: '铜鼓县',
            c: '26'
          },
          {
            n: '丰城市',
            c: '81'
          },
          {
            n: '樟树市',
            c: '82'
          },
          {
            n: '高安市',
            c: '83'
          }
        ]
      },
      {
        n: '抚州市',
        c: '10',
        city: [
          {
            n: '临川区',
            c: '02'
          },
          {
            n: '南城县',
            c: '21'
          },
          {
            n: '黎川县',
            c: '22'
          },
          {
            n: '南丰县',
            c: '23'
          },
          {
            n: '崇仁县',
            c: '24'
          },
          {
            n: '乐安县',
            c: '25'
          },
          {
            n: '宜黄县',
            c: '26'
          },
          {
            n: '金溪县',
            c: '27'
          },
          {
            n: '资溪县',
            c: '28'
          },
          {
            n: '东乡县',
            c: '29'
          },
          {
            n: '广昌县',
            c: '30'
          }
        ]
      },
      {
        n: '上饶市',
        c: '11',
        city: [
          {
            n: '信州区',
            c: '02'
          },
          {
            n: '上饶县',
            c: '21'
          },
          {
            n: '广丰县',
            c: '22'
          },
          {
            n: '玉山县',
            c: '23'
          },
          {
            n: '铅山县',
            c: '24'
          },
          {
            n: '横峰县',
            c: '25'
          },
          {
            n: '弋阳县',
            c: '26'
          },
          {
            n: '余干县',
            c: '27'
          },
          {
            n: '鄱阳县',
            c: '28'
          },
          {
            n: '万年县',
            c: '29'
          },
          {
            n: '婺源县',
            c: '30'
          },
          {
            n: '德兴市',
            c: '81'
          }
        ]
      }
    ]
  },
  {
    n: '山东',
    c: '37',
    s: [
      {
        n: '济南市',
        c: '01',
        city: [
          {
            n: '历下区',
            c: '02'
          },
          {
            n: '市中区',
            c: '03'
          },
          {
            n: '槐荫区',
            c: '04'
          },
          {
            n: '天桥区',
            c: '05'
          },
          {
            n: '历城区',
            c: '12'
          },
          {
            n: '长清区',
            c: '13'
          },
          {
            n: '平阴县',
            c: '24'
          },
          {
            n: '济阳县',
            c: '25'
          },
          {
            n: '商河县',
            c: '26'
          },
          {
            n: '章丘市',
            c: '81'
          }
        ]
      },
      {
        n: '青岛市',
        c: '02',
        city: [
          {
            n: '市南区',
            c: '02'
          },
          {
            n: '市北区',
            c: '03'
          },
          {
            n: '四方区',
            c: '05'
          },
          {
            n: '黄岛区',
            c: '11'
          },
          {
            n: '崂山区',
            c: '12'
          },
          {
            n: '李沧区',
            c: '13'
          },
          {
            n: '城阳区',
            c: '14'
          },
          {
            n: '胶州市',
            c: '81'
          },
          {
            n: '即墨市',
            c: '82'
          },
          {
            n: '平度市',
            c: '83'
          },
          {
            n: '胶南市',
            c: '84'
          },
          {
            n: '莱西市',
            c: '85'
          }
        ]
      },
      {
        n: '淄博市',
        c: '03',
        city: [
          {
            n: '淄川区',
            c: '02'
          },
          {
            n: '张店区',
            c: '03'
          },
          {
            n: '博山区',
            c: '04'
          },
          {
            n: '临淄区',
            c: '05'
          },
          {
            n: '周村区',
            c: '06'
          },
          {
            n: '桓台县',
            c: '21'
          },
          {
            n: '高青县',
            c: '22'
          },
          {
            n: '沂源县',
            c: '23'
          }
        ]
      },
      {
        n: '枣庄市',
        c: '04',
        city: [
          {
            n: '市中区',
            c: '02'
          },
          {
            n: '薛城区',
            c: '03'
          },
          {
            n: '峄城区',
            c: '04'
          },
          {
            n: '台儿庄区',
            c: '05'
          },
          {
            n: '山亭区',
            c: '06'
          },
          {
            n: '滕州市',
            c: '81'
          }
        ]
      },
      {
        n: '东营市',
        c: '05',
        city: [
          {
            n: '东营区',
            c: '02'
          },
          {
            n: '河口区',
            c: '03'
          },
          {
            n: '垦利县',
            c: '21'
          },
          {
            n: '利津县',
            c: '22'
          },
          {
            n: '广饶县',
            c: '23'
          }
        ]
      },
      {
        n: '烟台市',
        c: '06',
        city: [
          {
            n: '芝罘区',
            c: '02'
          },
          {
            n: '福山区',
            c: '11'
          },
          {
            n: '牟平区',
            c: '12'
          },
          {
            n: '莱山区',
            c: '13'
          },
          {
            n: '长岛县',
            c: '34'
          },
          {
            n: '龙口市',
            c: '81'
          },
          {
            n: '莱阳市',
            c: '82'
          },
          {
            n: '莱州市',
            c: '83'
          },
          {
            n: '蓬莱市',
            c: '84'
          },
          {
            n: '招远市',
            c: '85'
          },
          {
            n: '栖霞市',
            c: '86'
          },
          {
            n: '海阳市',
            c: '87'
          }
        ]
      },
      {
        n: '潍坊市',
        c: '07',
        city: [
          {
            n: '潍城区',
            c: '02'
          },
          {
            n: '寒亭区',
            c: '03'
          },
          {
            n: '坊子区',
            c: '04'
          },
          {
            n: '奎文区',
            c: '05'
          },
          {
            n: '临朐县',
            c: '24'
          },
          {
            n: '昌乐县',
            c: '25'
          },
          {
            n: '青州市',
            c: '81'
          },
          {
            n: '诸城市',
            c: '82'
          },
          {
            n: '寿光市',
            c: '83'
          },
          {
            n: '安丘市',
            c: '84'
          },
          {
            n: '高密市',
            c: '85'
          },
          {
            n: '昌邑市',
            c: '86'
          }
        ]
      },
      {
        n: '济宁市',
        c: '08',
        city: [
          {
            n: '市中区',
            c: '02'
          },
          {
            n: '任城区',
            c: '11'
          },
          {
            n: '微山县',
            c: '26'
          },
          {
            n: '鱼台县',
            c: '27'
          },
          {
            n: '金乡县',
            c: '28'
          },
          {
            n: '嘉祥县',
            c: '29'
          },
          {
            n: '汶上县',
            c: '30'
          },
          {
            n: '泗水县',
            c: '31'
          },
          {
            n: '梁山县',
            c: '32'
          },
          {
            n: '曲阜市',
            c: '81'
          },
          {
            n: '兖州市',
            c: '82'
          },
          {
            n: '邹城市',
            c: '83'
          }
        ]
      },
      {
        n: '泰安市',
        c: '09',
        city: [
          {
            n: '泰山区',
            c: '02'
          },
          {
            n: '岱岳区',
            c: '03'
          },
          {
            n: '宁阳县',
            c: '21'
          },
          {
            n: '东平县',
            c: '23'
          },
          {
            n: '新泰市',
            c: '82'
          },
          {
            n: '肥城市',
            c: '83'
          }
        ]
      },
      {
        n: '威海市',
        c: '10',
        city: [
          {
            n: '环翠区',
            c: '02'
          },
          {
            n: '文登市',
            c: '81'
          },
          {
            n: '荣成市',
            c: '82'
          },
          {
            n: '乳山市',
            c: '83'
          }
        ]
      },
      {
        n: '日照市',
        c: '11',
        city: [
          {
            n: '东港区',
            c: '02'
          },
          {
            n: '岚山区',
            c: '03'
          },
          {
            n: '五莲县',
            c: '21'
          },
          {
            n: '莒县',
            c: '22'
          }
        ]
      },
      {
        n: '莱芜市',
        c: '12',
        city: [
          {
            n: '莱城区',
            c: '02'
          },
          {
            n: '钢城区',
            c: '03'
          }
        ]
      },
      {
        n: '临沂市',
        c: '13',
        city: [
          {
            n: '兰山区',
            c: '02'
          },
          {
            n: '罗庄区',
            c: '11'
          },
          {
            n: '河东区',
            c: '12'
          },
          {
            n: '沂南县',
            c: '21'
          },
          {
            n: '郯城县',
            c: '22'
          },
          {
            n: '沂水县',
            c: '23'
          },
          {
            n: '苍山县',
            c: '24'
          },
          {
            n: '费县',
            c: '25'
          },
          {
            n: '平邑县',
            c: '26'
          },
          {
            n: '莒南县',
            c: '27'
          },
          {
            n: '蒙阴县',
            c: '28'
          },
          {
            n: '临沭县',
            c: '29'
          }
        ]
      },
      {
        n: '德州市',
        c: '14',
        city: [
          {
            n: '德城区',
            c: '02'
          },
          {
            n: '陵县',
            c: '21'
          },
          {
            n: '宁津县',
            c: '22'
          },
          {
            n: '庆云县',
            c: '23'
          },
          {
            n: '临邑县',
            c: '24'
          },
          {
            n: '齐河县',
            c: '25'
          },
          {
            n: '平原县',
            c: '26'
          },
          {
            n: '夏津县',
            c: '27'
          },
          {
            n: '武城县',
            c: '28'
          },
          {
            n: '乐陵市',
            c: '81'
          },
          {
            n: '禹城市',
            c: '82'
          }
        ]
      },
      {
        n: '聊城市',
        c: '15',
        city: [
          {
            n: '东昌府区',
            c: '02'
          },
          {
            n: '阳谷县',
            c: '21'
          },
          {
            n: '莘县',
            c: '22'
          },
          {
            n: '茌平县',
            c: '23'
          },
          {
            n: '东阿县',
            c: '24'
          },
          {
            n: '冠县',
            c: '25'
          },
          {
            n: '高唐县',
            c: '26'
          },
          {
            n: '临清市',
            c: '81'
          }
        ]
      },
      {
        n: '滨州市',
        c: '16',
        city: [
          {
            n: '滨城区',
            c: '02'
          },
          {
            n: '惠民县',
            c: '21'
          },
          {
            n: '阳信县',
            c: '22'
          },
          {
            n: '无棣县',
            c: '23'
          },
          {
            n: '沾化县',
            c: '24'
          },
          {
            n: '博兴县',
            c: '25'
          },
          {
            n: '邹平县',
            c: '26'
          }
        ]
      },
      {
        n: '菏泽市',
        c: '17',
        city: [
          {
            n: '牡丹区',
            c: '02'
          },
          {
            n: '曹县',
            c: '21'
          },
          {
            n: '单县',
            c: '22'
          },
          {
            n: '成武县',
            c: '23'
          },
          {
            n: '巨野县',
            c: '24'
          },
          {
            n: '郓城县',
            c: '25'
          },
          {
            n: '鄄城县',
            c: '26'
          },
          {
            n: '定陶县',
            c: '27'
          },
          {
            n: '东明县',
            c: '28'
          }
        ]
      }
    ]
  },
  {
    n: '河南',
    c: '41',
    s: [
      {
        n: '郑州市',
        c: '01',
        city: [
          {
            n: '中原区',
            c: '02'
          },
          {
            n: '二七区',
            c: '03'
          },
          {
            n: '管城回族区',
            c: '04'
          },
          {
            n: '金水区',
            c: '05'
          },
          {
            n: '上街区',
            c: '06'
          },
          {
            n: '惠济区',
            c: '08'
          },
          {
            n: '中牟县',
            c: '22'
          },
          {
            n: '巩义市',
            c: '81'
          },
          {
            n: '荥阳市',
            c: '82'
          },
          {
            n: '新密市',
            c: '83'
          },
          {
            n: '新郑市',
            c: '84'
          },
          {
            n: '登封市',
            c: '85'
          }
        ]
      },
      {
        n: '开封市',
        c: '02',
        city: [
          {
            n: '龙亭区',
            c: '02'
          },
          {
            n: '顺河回族区',
            c: '03'
          },
          {
            n: '鼓楼区',
            c: '04'
          },
          {
            n: '禹王台区',
            c: '05'
          },
          {
            n: '金明区',
            c: '11'
          },
          {
            n: '杞县',
            c: '21'
          },
          {
            n: '通许县',
            c: '22'
          },
          {
            n: '尉氏县',
            c: '23'
          },
          {
            n: '开封县',
            c: '24'
          },
          {
            n: '兰考县',
            c: '25'
          }
        ]
      },
      {
        n: '洛阳市',
        c: '03',
        city: [
          {
            n: '老城区',
            c: '02'
          },
          {
            n: '西工区',
            c: '03'
          },
          {
            n: '廛河回族区',
            c: '04'
          },
          {
            n: '涧西区',
            c: '05'
          },
          {
            n: '吉利区',
            c: '06'
          },
          {
            n: '洛龙区',
            c: '07'
          },
          {
            n: '孟津县',
            c: '22'
          },
          {
            n: '新安县',
            c: '23'
          },
          {
            n: '栾川县',
            c: '24'
          },
          {
            n: '嵩县',
            c: '25'
          },
          {
            n: '汝阳县',
            c: '26'
          },
          {
            n: '宜阳县',
            c: '27'
          },
          {
            n: '洛宁县',
            c: '28'
          },
          {
            n: '伊川县',
            c: '29'
          },
          {
            n: '偃师市',
            c: '81'
          }
        ]
      },
      {
        n: '平顶山市',
        c: '04',
        city: [
          {
            n: '新华区',
            c: '02'
          },
          {
            n: '卫东区',
            c: '03'
          },
          {
            n: '石龙区',
            c: '04'
          },
          {
            n: '湛河区',
            c: '11'
          },
          {
            n: '宝丰县',
            c: '21'
          },
          {
            n: '叶县',
            c: '22'
          },
          {
            n: '鲁山县',
            c: '23'
          },
          {
            n: '郏县',
            c: '25'
          },
          {
            n: '舞钢市',
            c: '81'
          },
          {
            n: '汝州市',
            c: '82'
          }
        ]
      },
      {
        n: '安阳市',
        c: '05',
        city: [
          {
            n: '文峰区',
            c: '02'
          },
          {
            n: '北关区',
            c: '03'
          },
          {
            n: '殷都区',
            c: '05'
          },
          {
            n: '龙安区',
            c: '06'
          },
          {
            n: '安阳县',
            c: '22'
          },
          {
            n: '汤阴县',
            c: '23'
          },
          {
            n: '滑县',
            c: '26'
          },
          {
            n: '内黄县',
            c: '27'
          },
          {
            n: '林州市',
            c: '81'
          }
        ]
      },
      {
        n: '鹤壁市',
        c: '06',
        city: [
          {
            n: '鹤山区',
            c: '02'
          },
          {
            n: '山城区',
            c: '03'
          },
          {
            n: '淇滨区',
            c: '11'
          },
          {
            n: '浚县',
            c: '21'
          },
          {
            n: '淇县',
            c: '22'
          }
        ]
      },
      {
        n: '新乡市',
        c: '07',
        city: [
          {
            n: '红旗区',
            c: '02'
          },
          {
            n: '卫滨区',
            c: '03'
          },
          {
            n: '凤泉区',
            c: '04'
          },
          {
            n: '牧野区',
            c: '11'
          },
          {
            n: '新乡县',
            c: '21'
          },
          {
            n: '获嘉县',
            c: '24'
          },
          {
            n: '原阳县',
            c: '25'
          },
          {
            n: '延津县',
            c: '26'
          },
          {
            n: '封丘县',
            c: '27'
          },
          {
            n: '长垣县',
            c: '28'
          },
          {
            n: '卫辉市',
            c: '81'
          },
          {
            n: '辉县市',
            c: '82'
          }
        ]
      },
      {
        n: '焦作市',
        c: '08',
        city: [
          {
            n: '解放区',
            c: '02'
          },
          {
            n: '中站区',
            c: '03'
          },
          {
            n: '马村区',
            c: '04'
          },
          {
            n: '山阳区',
            c: '11'
          },
          {
            n: '修武县',
            c: '21'
          },
          {
            n: '博爱县',
            c: '22'
          },
          {
            n: '武陟县',
            c: '23'
          },
          {
            n: '温县',
            c: '25'
          },
          {
            n: '济源市',
            c: '81'
          },
          {
            n: '沁阳市',
            c: '82'
          },
          {
            n: '孟州市',
            c: '83'
          }
        ]
      },
      {
        n: '濮阳市',
        c: '09',
        city: [
          {
            n: '华龙区',
            c: '02'
          },
          {
            n: '清丰县',
            c: '22'
          },
          {
            n: '南乐县',
            c: '23'
          },
          {
            n: '范县',
            c: '26'
          },
          {
            n: '台前县',
            c: '27'
          },
          {
            n: '濮阳县',
            c: '28'
          }
        ]
      },
      {
        n: '许昌市',
        c: '10',
        city: [
          {
            n: '魏都区',
            c: '02'
          },
          {
            n: '许昌县',
            c: '23'
          },
          {
            n: '鄢陵县',
            c: '24'
          },
          {
            n: '襄城县',
            c: '25'
          },
          {
            n: '禹州市',
            c: '81'
          },
          {
            n: '长葛市',
            c: '82'
          }
        ]
      },
      {
        n: '漯河市',
        c: '11',
        city: [
          {
            n: '源汇区',
            c: '02'
          },
          {
            n: '郾城区',
            c: '03'
          },
          {
            n: '召陵区',
            c: '04'
          },
          {
            n: '舞阳县',
            c: '21'
          },
          {
            n: '临颍县',
            c: '22'
          }
        ]
      },
      {
        n: '三门峡市',
        c: '12',
        city: [
          {
            n: '湖滨区',
            c: '02'
          },
          {
            n: '渑池县',
            c: '21'
          },
          {
            n: '陕县',
            c: '22'
          },
          {
            n: '卢氏县',
            c: '24'
          },
          {
            n: '义马市',
            c: '81'
          },
          {
            n: '灵宝市',
            c: '82'
          }
        ]
      },
      {
        n: '南阳市',
        c: '13',
        city: [
          {
            n: '宛城区',
            c: '02'
          },
          {
            n: '卧龙区',
            c: '03'
          },
          {
            n: '南召县',
            c: '21'
          },
          {
            n: '方城县',
            c: '22'
          },
          {
            n: '西峡县',
            c: '23'
          },
          {
            n: '镇平县',
            c: '24'
          },
          {
            n: '内乡县',
            c: '25'
          },
          {
            n: '淅川县',
            c: '26'
          },
          {
            n: '社旗县',
            c: '27'
          },
          {
            n: '唐河县',
            c: '28'
          },
          {
            n: '新野县',
            c: '29'
          },
          {
            n: '桐柏县',
            c: '30'
          },
          {
            n: '邓州市',
            c: '81'
          }
        ]
      },
      {
        n: '商丘市',
        c: '14',
        city: [
          {
            n: '梁园区',
            c: '02'
          },
          {
            n: '睢阳区',
            c: '03'
          },
          {
            n: '民权县',
            c: '21'
          },
          {
            n: '睢县',
            c: '22'
          },
          {
            n: '宁陵县',
            c: '23'
          },
          {
            n: '柘城县',
            c: '24'
          },
          {
            n: '虞城县',
            c: '25'
          },
          {
            n: '夏邑县',
            c: '26'
          },
          {
            n: '永城市',
            c: '81'
          }
        ]
      },
      {
        n: '信阳市',
        c: '15',
        city: [
          {
            n: '浉河区',
            c: '02'
          },
          {
            n: '平桥区',
            c: '03'
          },
          {
            n: '罗山县',
            c: '21'
          },
          {
            n: '光山县',
            c: '22'
          },
          {
            n: '新县',
            c: '23'
          },
          {
            n: '商城县',
            c: '24'
          },
          {
            n: '固始县',
            c: '25'
          },
          {
            n: '潢川县',
            c: '26'
          },
          {
            n: '淮滨县',
            c: '27'
          },
          {
            n: '息县',
            c: '28'
          }
        ]
      },
      {
        n: '周口市',
        c: '16',
        city: [
          {
            n: '川汇区',
            c: '02'
          },
          {
            n: '扶沟县',
            c: '21'
          },
          {
            n: '西华县',
            c: '22'
          },
          {
            n: '商水县',
            c: '23'
          },
          {
            n: '沈丘县',
            c: '24'
          },
          {
            n: '郸城县',
            c: '25'
          },
          {
            n: '淮阳县',
            c: '26'
          },
          {
            n: '太康县',
            c: '27'
          },
          {
            n: '鹿邑县',
            c: '28'
          },
          {
            n: '项城市',
            c: '81'
          }
        ]
      },
      {
        n: '驻马店市',
        c: '17',
        city: [
          {
            n: '驿城区',
            c: '02'
          },
          {
            n: '西平县',
            c: '21'
          },
          {
            n: '上蔡县',
            c: '22'
          },
          {
            n: '平舆县',
            c: '23'
          },
          {
            n: '正阳县',
            c: '24'
          },
          {
            n: '确山县',
            c: '25'
          },
          {
            n: '泌阳县',
            c: '26'
          },
          {
            n: '汝南县',
            c: '27'
          },
          {
            n: '遂平县',
            c: '28'
          },
          {
            n: '新蔡县',
            c: '29'
          }
        ]
      }
    ]
  },
  {
    n: '湖北',
    c: '42',
    s: [
      {
        n: '武汉市',
        c: '01',
        city: [
          {
            n: '江岸区',
            c: '02'
          },
          {
            n: '江汉区',
            c: '03'
          },
          {
            n: '硚口区',
            c: '04'
          },
          {
            n: '汉阳区',
            c: '05'
          },
          {
            n: '武昌区',
            c: '06'
          },
          {
            n: '青山区',
            c: '07'
          },
          {
            n: '洪山区',
            c: '11'
          },
          {
            n: '东西湖区',
            c: '12'
          },
          {
            n: '汉南区',
            c: '13'
          },
          {
            n: '蔡甸区',
            c: '14'
          },
          {
            n: '江夏区',
            c: '15'
          },
          {
            n: '黄陂区',
            c: '16'
          },
          {
            n: '新洲区',
            c: '17'
          }
        ]
      },
      {
        n: '黄石市',
        c: '02',
        city: [
          {
            n: '黄石港区',
            c: '02'
          },
          {
            n: '西塞山区',
            c: '03'
          },
          {
            n: '下陆区',
            c: '04'
          },
          {
            n: '铁山区',
            c: '05'
          },
          {
            n: '阳新县',
            c: '22'
          },
          {
            n: '大冶市',
            c: '81'
          }
        ]
      },
      {
        n: '十堰市',
        c: '03',
        city: [
          {
            n: '茅箭区',
            c: '02'
          },
          {
            n: '张湾区',
            c: '03'
          },
          {
            n: '郧县',
            c: '21'
          },
          {
            n: '郧西县',
            c: '22'
          },
          {
            n: '竹山县',
            c: '23'
          },
          {
            n: '竹溪县',
            c: '24'
          },
          {
            n: '房县',
            c: '25'
          },
          {
            n: '丹江口市',
            c: '81'
          }
        ]
      },
      {
        n: '宜昌市',
        c: '05',
        city: [
          {
            n: '西陵区',
            c: '02'
          },
          {
            n: '伍家岗区',
            c: '03'
          },
          {
            n: '点军区',
            c: '04'
          },
          {
            n: '猇亭区',
            c: '05'
          },
          {
            n: '夷陵区',
            c: '06'
          },
          {
            n: '远安县',
            c: '25'
          },
          {
            n: '兴山县',
            c: '26'
          },
          {
            n: '秭归县',
            c: '27'
          },
          {
            n: '长阳土家族自治县',
            c: '28'
          },
          {
            n: '五峰土家族自治县',
            c: '29'
          },
          {
            n: '宜都市',
            c: '81'
          },
          {
            n: '当阳市',
            c: '82'
          },
          {
            n: '枝江市',
            c: '83'
          }
        ]
      },
      {
        n: '襄樊市',
        c: '06',
        city: [
          {
            n: '襄城区',
            c: '02'
          },
          {
            n: '樊城区',
            c: '06'
          },
          {
            n: '襄阳区',
            c: '07'
          },
          {
            n: '南漳县',
            c: '24'
          },
          {
            n: '谷城县',
            c: '25'
          },
          {
            n: '保康县',
            c: '26'
          },
          {
            n: '老河口市',
            c: '82'
          },
          {
            n: '枣阳市',
            c: '83'
          },
          {
            n: '宜城市',
            c: '84'
          }
        ]
      },
      {
        n: '鄂州市',
        c: '07',
        city: [
          {
            n: '梁子湖区',
            c: '02'
          },
          {
            n: '华容区',
            c: '03'
          },
          {
            n: '鄂城区',
            c: '04'
          }
        ]
      },
      {
        n: '荆门市',
        c: '08',
        city: [
          {
            n: '东宝区',
            c: '02'
          },
          {
            n: '掇刀区',
            c: '04'
          },
          {
            n: '京山县',
            c: '21'
          },
          {
            n: '沙洋县',
            c: '22'
          },
          {
            n: '钟祥市',
            c: '81'
          }
        ]
      },
      {
        n: '孝感市',
        c: '09',
        city: [
          {
            n: '孝南区',
            c: '02'
          },
          {
            n: '孝昌县',
            c: '21'
          },
          {
            n: '大悟县',
            c: '22'
          },
          {
            n: '云梦县',
            c: '23'
          },
          {
            n: '应城市',
            c: '81'
          },
          {
            n: '安陆市',
            c: '82'
          },
          {
            n: '汉川市',
            c: '84'
          }
        ]
      },
      {
        n: '荆州市',
        c: '10',
        city: [
          {
            n: '沙市区',
            c: '02'
          },
          {
            n: '荆州区',
            c: '03'
          },
          {
            n: '公安县',
            c: '22'
          },
          {
            n: '监利县',
            c: '23'
          },
          {
            n: '江陵县',
            c: '24'
          },
          {
            n: '石首市',
            c: '81'
          },
          {
            n: '洪湖市',
            c: '83'
          },
          {
            n: '松滋市',
            c: '87'
          }
        ]
      },
      {
        n: '黄冈市',
        c: '11',
        city: [
          {
            n: '黄州区',
            c: '02'
          },
          {
            n: '团风县',
            c: '21'
          },
          {
            n: '红安县',
            c: '22'
          },
          {
            n: '罗田县',
            c: '23'
          },
          {
            n: '英山县',
            c: '24'
          },
          {
            n: '浠水县',
            c: '25'
          },
          {
            n: '蕲春县',
            c: '26'
          },
          {
            n: '黄梅县',
            c: '27'
          },
          {
            n: '麻城市',
            c: '81'
          },
          {
            n: '武穴市',
            c: '82'
          }
        ]
      },
      {
        n: '咸宁市',
        c: '12',
        city: [
          {
            n: '咸安区',
            c: '02'
          },
          {
            n: '嘉鱼县',
            c: '21'
          },
          {
            n: '通城县',
            c: '22'
          },
          {
            n: '崇阳县',
            c: '23'
          },
          {
            n: '通山县',
            c: '24'
          },
          {
            n: '赤壁市',
            c: '81'
          }
        ]
      },
      {
        n: '随州市',
        c: '13',
        city: [
          {
            n: '曾都区',
            c: '02'
          },
          {
            n: '广水市',
            c: '81'
          }
        ]
      },
      {
        n: '恩施土家族苗族自治州',
        c: '28',
        city: [
          {
            n: '恩施市',
            c: '01'
          },
          {
            n: '利川市',
            c: '02'
          },
          {
            n: '建始县',
            c: '22'
          },
          {
            n: '巴东县',
            c: '23'
          },
          {
            n: '宣恩县',
            c: '25'
          },
          {
            n: '咸丰县',
            c: '26'
          },
          {
            n: '来凤县',
            c: '27'
          },
          {
            n: '鹤峰县',
            c: '28'
          }
        ]
      },
      {
        n: '直辖行政单位',
        c: '90',
        city: [
          {
            n: '仙桃市',
            c: '04'
          },
          {
            n: '潜江市',
            c: '05'
          },
          {
            n: '天门市',
            c: '06'
          },
          {
            n: '神农架林区',
            c: '21'
          }
        ]
      }
    ]
  },
  {
    n: '湖南',
    c: '43',
    s: [
      {
        n: '长沙市',
        c: '01',
        city: [
          {
            n: '芙蓉区',
            c: '02'
          },
          {
            n: '天心区',
            c: '03'
          },
          {
            n: '岳麓区',
            c: '04'
          },
          {
            n: '开福区',
            c: '05'
          },
          {
            n: '雨花区',
            c: '11'
          },
          {
            n: '长沙县',
            c: '21'
          },
          {
            n: '望城县',
            c: '22'
          },
          {
            n: '宁乡县',
            c: '24'
          },
          {
            n: '浏阳市',
            c: '81'
          }
        ]
      },
      {
        n: '株洲市',
        c: '02',
        city: [
          {
            n: '荷塘区',
            c: '02'
          },
          {
            n: '芦淞区',
            c: '03'
          },
          {
            n: '石峰区',
            c: '04'
          },
          {
            n: '天元区',
            c: '11'
          },
          {
            n: '株洲县',
            c: '21'
          },
          {
            n: '攸县',
            c: '23'
          },
          {
            n: '茶陵县',
            c: '24'
          },
          {
            n: '炎陵县',
            c: '25'
          },
          {
            n: '醴陵市',
            c: '81'
          }
        ]
      },
      {
        n: '湘潭市',
        c: '03',
        city: [
          {
            n: '雨湖区',
            c: '02'
          },
          {
            n: '岳塘区',
            c: '04'
          },
          {
            n: '湘潭县',
            c: '21'
          },
          {
            n: '湘乡市',
            c: '81'
          },
          {
            n: '韶山市',
            c: '82'
          }
        ]
      },
      {
        n: '衡阳市',
        c: '04',
        city: [
          {
            n: '珠晖区',
            c: '05'
          },
          {
            n: '雁峰区',
            c: '06'
          },
          {
            n: '石鼓区',
            c: '07'
          },
          {
            n: '蒸湘区',
            c: '08'
          },
          {
            n: '南岳区',
            c: '12'
          },
          {
            n: '衡阳县',
            c: '21'
          },
          {
            n: '衡南县',
            c: '22'
          },
          {
            n: '衡山县',
            c: '23'
          },
          {
            n: '衡东县',
            c: '24'
          },
          {
            n: '祁东县',
            c: '26'
          },
          {
            n: '耒阳市',
            c: '81'
          },
          {
            n: '常宁市',
            c: '82'
          }
        ]
      },
      {
        n: '邵阳市',
        c: '05',
        city: [
          {
            n: '双清区',
            c: '02'
          },
          {
            n: '大祥区',
            c: '03'
          },
          {
            n: '北塔区',
            c: '11'
          },
          {
            n: '邵东县',
            c: '21'
          },
          {
            n: '新邵县',
            c: '22'
          },
          {
            n: '邵阳县',
            c: '23'
          },
          {
            n: '隆回县',
            c: '24'
          },
          {
            n: '洞口县',
            c: '25'
          },
          {
            n: '绥宁县',
            c: '27'
          },
          {
            n: '新宁县',
            c: '28'
          },
          {
            n: '城步苗族自治县',
            c: '29'
          },
          {
            n: '武冈市',
            c: '81'
          }
        ]
      },
      {
        n: '岳阳市',
        c: '06',
        city: [
          {
            n: '岳阳楼区',
            c: '02'
          },
          {
            n: '云溪区',
            c: '03'
          },
          {
            n: '君山区',
            c: '11'
          },
          {
            n: '岳阳县',
            c: '21'
          },
          {
            n: '华容县',
            c: '23'
          },
          {
            n: '湘阴县',
            c: '24'
          },
          {
            n: '平江县',
            c: '26'
          },
          {
            n: '汨罗市',
            c: '81'
          },
          {
            n: '临湘市',
            c: '82'
          }
        ]
      },
      {
        n: '常德市',
        c: '07',
        city: [
          {
            n: '武陵区',
            c: '02'
          },
          {
            n: '鼎城区',
            c: '03'
          },
          {
            n: '安乡县',
            c: '21'
          },
          {
            n: '汉寿县',
            c: '22'
          },
          {
            n: '澧县',
            c: '23'
          },
          {
            n: '临澧县',
            c: '24'
          },
          {
            n: '桃源县',
            c: '25'
          },
          {
            n: '石门县',
            c: '26'
          },
          {
            n: '津市市',
            c: '81'
          }
        ]
      },
      {
        n: '张家界市',
        c: '08',
        city: [
          {
            n: '永定区',
            c: '02'
          },
          {
            n: '武陵源区',
            c: '11'
          },
          {
            n: '慈利县',
            c: '21'
          },
          {
            n: '桑植县',
            c: '22'
          }
        ]
      },
      {
        n: '益阳市',
        c: '09',
        city: [
          {
            n: '资阳区',
            c: '02'
          },
          {
            n: '赫山区',
            c: '03'
          },
          {
            n: '南县',
            c: '21'
          },
          {
            n: '桃江县',
            c: '22'
          },
          {
            n: '安化县',
            c: '23'
          },
          {
            n: '沅江市',
            c: '81'
          }
        ]
      },
      {
        n: '郴州市',
        c: '10',
        city: [
          {
            n: '北湖区',
            c: '02'
          },
          {
            n: '苏仙区',
            c: '03'
          },
          {
            n: '桂阳县',
            c: '21'
          },
          {
            n: '宜章县',
            c: '22'
          },
          {
            n: '永兴县',
            c: '23'
          },
          {
            n: '嘉禾县',
            c: '24'
          },
          {
            n: '临武县',
            c: '25'
          },
          {
            n: '汝城县',
            c: '26'
          },
          {
            n: '桂东县',
            c: '27'
          },
          {
            n: '安仁县',
            c: '28'
          },
          {
            n: '资兴市',
            c: '81'
          }
        ]
      },
      {
        n: '永州市',
        c: '11',
        city: [
          {
            n: '零陵区',
            c: '02'
          },
          {
            n: '冷水滩区',
            c: '03'
          },
          {
            n: '祁阳县',
            c: '21'
          },
          {
            n: '东安县',
            c: '22'
          },
          {
            n: '双牌县',
            c: '23'
          },
          {
            n: '道县',
            c: '24'
          },
          {
            n: '江永县',
            c: '25'
          },
          {
            n: '宁远县',
            c: '26'
          },
          {
            n: '蓝山县',
            c: '27'
          },
          {
            n: '新田县',
            c: '28'
          },
          {
            n: '江华瑶族自治县',
            c: '29'
          }
        ]
      },
      {
        n: '怀化市',
        c: '12',
        city: [
          {
            n: '鹤城区',
            c: '02'
          },
          {
            n: '中方县',
            c: '21'
          },
          {
            n: '沅陵县',
            c: '22'
          },
          {
            n: '辰溪县',
            c: '23'
          },
          {
            n: '溆浦县',
            c: '24'
          },
          {
            n: '会同县',
            c: '25'
          },
          {
            n: '麻阳苗族自治县',
            c: '26'
          },
          {
            n: '新晃侗族自治县',
            c: '27'
          },
          {
            n: '芷江侗族自治县',
            c: '28'
          },
          {
            n: '靖州苗族侗族自治县',
            c: '29'
          },
          {
            n: '通道侗族自治县',
            c: '30'
          },
          {
            n: '洪江市',
            c: '81'
          }
        ]
      },
      {
        n: '娄底市',
        c: '13',
        city: [
          {
            n: '娄星区',
            c: '02'
          },
          {
            n: '双峰县',
            c: '21'
          },
          {
            n: '新化县',
            c: '22'
          },
          {
            n: '冷水江市',
            c: '81'
          },
          {
            n: '涟源市',
            c: '82'
          }
        ]
      },
      {
        n: '湘西土家族苗族自治州',
        c: '31',
        city: [
          {
            n: '吉首市',
            c: '01'
          },
          {
            n: '泸溪县',
            c: '22'
          },
          {
            n: '凤凰县',
            c: '23'
          },
          {
            n: '花垣县',
            c: '24'
          },
          {
            n: '保靖县',
            c: '25'
          },
          {
            n: '古丈县',
            c: '26'
          },
          {
            n: '永顺县',
            c: '27'
          },
          {
            n: '龙山县',
            c: '30'
          }
        ]
      }
    ]
  },
  {
    n: '广东',
    c: '44',
    s: [
      {
        n: '广州市',
        c: '01',
        city: [
          {
            n: '荔湾区',
            c: '03'
          },
          {
            n: '越秀区',
            c: '04'
          },
          {
            n: '海珠区',
            c: '05'
          },
          {
            n: '天河区',
            c: '06'
          },
          {
            n: '白云区',
            c: '11'
          },
          {
            n: '黄埔区',
            c: '12'
          },
          {
            n: '番禺区',
            c: '13'
          },
          {
            n: '花都区',
            c: '14'
          },
          {
            n: '南沙区',
            c: '15'
          },
          {
            n: '萝岗区',
            c: '16'
          },
          {
            n: '增城市',
            c: '83'
          },
          {
            n: '从化市',
            c: '84'
          }
        ]
      },
      {
        n: '韶关市',
        c: '02',
        city: [
          {
            n: '武江区',
            c: '03'
          },
          {
            n: '浈江区',
            c: '04'
          },
          {
            n: '曲江区',
            c: '05'
          },
          {
            n: '始兴县',
            c: '22'
          },
          {
            n: '仁化县',
            c: '24'
          },
          {
            n: '翁源县',
            c: '29'
          },
          {
            n: '乳源瑶族自治县',
            c: '32'
          },
          {
            n: '新丰县',
            c: '33'
          },
          {
            n: '乐昌市',
            c: '81'
          },
          {
            n: '南雄市',
            c: '82'
          }
        ]
      },
      {
        n: '深圳市',
        c: '03',
        city: [
          {
            n: '罗湖区',
            c: '03'
          },
          {
            n: '福田区',
            c: '04'
          },
          {
            n: '南山区',
            c: '05'
          },
          {
            n: '宝安区',
            c: '06'
          },
          {
            n: '龙岗区',
            c: '07'
          },
          {
            n: '盐田区',
            c: '08'
          }
        ]
      },
      {
        n: '珠海市',
        c: '04',
        city: [
          {
            n: '香洲区',
            c: '02'
          },
          {
            n: '斗门区',
            c: '03'
          },
          {
            n: '金湾区',
            c: '04'
          }
        ]
      },
      {
        n: '汕头市',
        c: '05',
        city: [
          {
            n: '龙湖区',
            c: '07'
          },
          {
            n: '金平区',
            c: '11'
          },
          {
            n: '濠江区',
            c: '12'
          },
          {
            n: '潮阳区',
            c: '13'
          },
          {
            n: '潮南区',
            c: '14'
          },
          {
            n: '澄海区',
            c: '15'
          },
          {
            n: '南澳县',
            c: '23'
          }
        ]
      },
      {
        n: '佛山市',
        c: '06',
        city: [
          {
            n: '禅城区',
            c: '04'
          },
          {
            n: '南海区',
            c: '05'
          },
          {
            n: '顺德区',
            c: '06'
          },
          {
            n: '三水区',
            c: '07'
          },
          {
            n: '高明区',
            c: '08'
          }
        ]
      },
      {
        n: '江门市',
        c: '07',
        city: [
          {
            n: '蓬江区',
            c: '03'
          },
          {
            n: '江海区',
            c: '04'
          },
          {
            n: '新会区',
            c: '05'
          },
          {
            n: '台山市',
            c: '81'
          },
          {
            n: '开平市',
            c: '83'
          },
          {
            n: '鹤山市',
            c: '84'
          },
          {
            n: '恩平市',
            c: '85'
          }
        ]
      },
      {
        n: '湛江市',
        c: '08',
        city: [
          {
            n: '赤坎区',
            c: '02'
          },
          {
            n: '霞山区',
            c: '03'
          },
          {
            n: '坡头区',
            c: '04'
          },
          {
            n: '麻章区',
            c: '11'
          },
          {
            n: '遂溪县',
            c: '23'
          },
          {
            n: '徐闻县',
            c: '25'
          },
          {
            n: '廉江市',
            c: '81'
          },
          {
            n: '雷州市',
            c: '82'
          },
          {
            n: '吴川市',
            c: '83'
          }
        ]
      },
      {
        n: '茂名市',
        c: '09',
        city: [
          {
            n: '茂南区',
            c: '02'
          },
          {
            n: '茂港区',
            c: '03'
          },
          {
            n: '电白县',
            c: '23'
          },
          {
            n: '高州市',
            c: '81'
          },
          {
            n: '化州市',
            c: '82'
          },
          {
            n: '信宜市',
            c: '83'
          }
        ]
      },
      {
        n: '肇庆市',
        c: '12',
        city: [
          {
            n: '端州区',
            c: '02'
          },
          {
            n: '鼎湖区',
            c: '03'
          },
          {
            n: '广宁县',
            c: '23'
          },
          {
            n: '怀集县',
            c: '24'
          },
          {
            n: '封开县',
            c: '25'
          },
          {
            n: '德庆县',
            c: '26'
          },
          {
            n: '高要市',
            c: '83'
          },
          {
            n: '四会市',
            c: '84'
          }
        ]
      },
      {
        n: '惠州市',
        c: '13',
        city: [
          {
            n: '惠城区',
            c: '02'
          },
          {
            n: '惠阳区',
            c: '03'
          },
          {
            n: '博罗县',
            c: '22'
          },
          {
            n: '惠东县',
            c: '23'
          },
          {
            n: '龙门县',
            c: '24'
          }
        ]
      },
      {
        n: '梅州市',
        c: '14',
        city: [
          {
            n: '梅江区',
            c: '02'
          },
          {
            n: '梅县',
            c: '21'
          },
          {
            n: '大埔县',
            c: '22'
          },
          {
            n: '丰顺县',
            c: '23'
          },
          {
            n: '五华县',
            c: '24'
          },
          {
            n: '平远县',
            c: '26'
          },
          {
            n: '蕉岭县',
            c: '27'
          },
          {
            n: '兴宁市',
            c: '81'
          }
        ]
      },
      {
        n: '汕尾市',
        c: '15',
        city: [
          {
            n: '城区',
            c: '02'
          },
          {
            n: '海丰县',
            c: '21'
          },
          {
            n: '陆河县',
            c: '23'
          },
          {
            n: '陆丰市',
            c: '81'
          }
        ]
      },
      {
        n: '河源市',
        c: '16',
        city: [
          {
            n: '源城区',
            c: '02'
          },
          {
            n: '紫金县',
            c: '21'
          },
          {
            n: '龙川县',
            c: '22'
          },
          {
            n: '连平县',
            c: '23'
          },
          {
            n: '和平县',
            c: '24'
          },
          {
            n: '东源县',
            c: '25'
          }
        ]
      },
      {
        n: '阳江市',
        c: '17',
        city: [
          {
            n: '江城区',
            c: '02'
          },
          {
            n: '阳西县',
            c: '21'
          },
          {
            n: '阳东县',
            c: '23'
          },
          {
            n: '阳春市',
            c: '81'
          }
        ]
      },
      {
        n: '清远市',
        c: '18',
        city: [
          {
            n: '清城区',
            c: '02'
          },
          {
            n: '佛冈县',
            c: '21'
          },
          {
            n: '阳山县',
            c: '23'
          },
          {
            n: '连山壮族瑶族自治县',
            c: '25'
          },
          {
            n: '连南瑶族自治县',
            c: '26'
          },
          {
            n: '清新县',
            c: '27'
          },
          {
            n: '英德市',
            c: '81'
          },
          {
            n: '连州市',
            c: '82'
          }
        ]
      },
      {
        n: '东莞市',
        c: '19',
        city: {
          n: '市辖区',
          c: '01'
        }
      },
      {
        n: '中山市',
        c: '20',
        city: {
          n: '市辖区',
          c: '01'
        }
      },
      {
        n: '潮州市',
        c: '51',
        city: [
          {
            n: '湘桥区',
            c: '02'
          },
          {
            n: '潮安县',
            c: '21'
          },
          {
            n: '饶平县',
            c: '22'
          }
        ]
      },
      {
        n: '揭阳市',
        c: '52',
        city: [
          {
            n: '榕城区',
            c: '02'
          },
          {
            n: '揭东县',
            c: '21'
          },
          {
            n: '揭西县',
            c: '22'
          },
          {
            n: '惠来县',
            c: '24'
          },
          {
            n: '普宁市',
            c: '81'
          }
        ]
      },
      {
        n: '云浮市',
        c: '53',
        city: [
          {
            n: '云城区',
            c: '02'
          },
          {
            n: '新兴县',
            c: '21'
          },
          {
            n: '郁南县',
            c: '22'
          },
          {
            n: '云安县',
            c: '23'
          },
          {
            n: '罗定市',
            c: '81'
          }
        ]
      }
    ]
  },
  {
    n: '广西',
    c: '45',
    s: [
      {
        n: '南宁市',
        c: '01',
        city: [
          {
            n: '兴宁区',
            c: '02'
          },
          {
            n: '青秀区',
            c: '03'
          },
          {
            n: '江南区',
            c: '05'
          },
          {
            n: '西乡塘区',
            c: '07'
          },
          {
            n: '良庆区',
            c: '08'
          },
          {
            n: '邕宁区',
            c: '09'
          },
          {
            n: '武鸣县',
            c: '22'
          },
          {
            n: '隆安县',
            c: '23'
          },
          {
            n: '马山县',
            c: '24'
          },
          {
            n: '上林县',
            c: '25'
          },
          {
            n: '宾阳县',
            c: '26'
          },
          {
            n: '横县',
            c: '27'
          }
        ]
      },
      {
        n: '柳州市',
        c: '02',
        city: [
          {
            n: '城中区',
            c: '02'
          },
          {
            n: '鱼峰区',
            c: '03'
          },
          {
            n: '柳南区',
            c: '04'
          },
          {
            n: '柳北区',
            c: '05'
          },
          {
            n: '柳江县',
            c: '21'
          },
          {
            n: '柳城县',
            c: '22'
          },
          {
            n: '鹿寨县',
            c: '23'
          },
          {
            n: '融安县',
            c: '24'
          },
          {
            n: '融水苗族自治县',
            c: '25'
          },
          {
            n: '三江侗族自治县',
            c: '26'
          }
        ]
      },
      {
        n: '桂林市',
        c: '03',
        city: [
          {
            n: '秀峰区',
            c: '02'
          },
          {
            n: '叠彩区',
            c: '03'
          },
          {
            n: '象山区',
            c: '04'
          },
          {
            n: '七星区',
            c: '05'
          },
          {
            n: '雁山区',
            c: '11'
          },
          {
            n: '阳朔县',
            c: '21'
          },
          {
            n: '临桂县',
            c: '22'
          },
          {
            n: '灵川县',
            c: '23'
          },
          {
            n: '全州县',
            c: '24'
          },
          {
            n: '兴安县',
            c: '25'
          },
          {
            n: '永福县',
            c: '26'
          },
          {
            n: '灌阳县',
            c: '27'
          },
          {
            n: '龙胜各族自治县',
            c: '28'
          },
          {
            n: '资源县',
            c: '29'
          },
          {
            n: '平乐县',
            c: '30'
          },
          {
            n: '荔蒲县',
            c: '31'
          },
          {
            n: '恭城瑶族自治县',
            c: '32'
          }
        ]
      },
      {
        n: '梧州市',
        c: '04',
        city: [
          {
            n: '万秀区',
            c: '03'
          },
          {
            n: '蝶山区',
            c: '04'
          },
          {
            n: '长洲区',
            c: '05'
          },
          {
            n: '苍梧县',
            c: '21'
          },
          {
            n: '藤县',
            c: '22'
          },
          {
            n: '蒙山县',
            c: '23'
          },
          {
            n: '岑溪市',
            c: '81'
          }
        ]
      },
      {
        n: '北海市',
        c: '05',
        city: [
          {
            n: '海城区',
            c: '02'
          },
          {
            n: '银海区',
            c: '03'
          },
          {
            n: '铁山港区',
            c: '12'
          },
          {
            n: '合浦县',
            c: '21'
          }
        ]
      },
      {
        n: '防城港市',
        c: '06',
        city: [
          {
            n: '港口区',
            c: '02'
          },
          {
            n: '防城区',
            c: '03'
          },
          {
            n: '上思县',
            c: '21'
          },
          {
            n: '东兴市',
            c: '81'
          }
        ]
      },
      {
        n: '钦州市',
        c: '07',
        city: [
          {
            n: '钦南区',
            c: '02'
          },
          {
            n: '钦北区',
            c: '03'
          },
          {
            n: '灵山县',
            c: '21'
          },
          {
            n: '浦北县',
            c: '22'
          }
        ]
      },
      {
        n: '贵港市',
        c: '08',
        city: [
          {
            n: '港北区',
            c: '02'
          },
          {
            n: '港南区',
            c: '03'
          },
          {
            n: '覃塘区',
            c: '04'
          },
          {
            n: '平南县',
            c: '21'
          },
          {
            n: '桂平市',
            c: '81'
          }
        ]
      },
      {
        n: '玉林市',
        c: '09',
        city: [
          {
            n: '玉州区',
            c: '02'
          },
          {
            n: '容县',
            c: '21'
          },
          {
            n: '陆川县',
            c: '22'
          },
          {
            n: '博白县',
            c: '23'
          },
          {
            n: '兴业县',
            c: '24'
          },
          {
            n: '北流市',
            c: '81'
          }
        ]
      },
      {
        n: '百色市',
        c: '10',
        city: [
          {
            n: '右江区',
            c: '02'
          },
          {
            n: '田阳县',
            c: '21'
          },
          {
            n: '田东县',
            c: '22'
          },
          {
            n: '平果县',
            c: '23'
          },
          {
            n: '德保县',
            c: '24'
          },
          {
            n: '靖西县',
            c: '25'
          },
          {
            n: '那坡县',
            c: '26'
          },
          {
            n: '凌云县',
            c: '27'
          },
          {
            n: '乐业县',
            c: '28'
          },
          {
            n: '田林县',
            c: '29'
          },
          {
            n: '西林县',
            c: '30'
          },
          {
            n: '隆林各族自治县',
            c: '31'
          }
        ]
      },
      {
        n: '贺州市',
        c: '11',
        city: [
          {
            n: '八步区',
            c: '02'
          },
          {
            n: '昭平县',
            c: '21'
          },
          {
            n: '钟山县',
            c: '22'
          },
          {
            n: '富川瑶族自治县',
            c: '23'
          }
        ]
      },
      {
        n: '河池市',
        c: '12',
        city: [
          {
            n: '金城江区',
            c: '02'
          },
          {
            n: '南丹县',
            c: '21'
          },
          {
            n: '天峨县',
            c: '22'
          },
          {
            n: '凤山县',
            c: '23'
          },
          {
            n: '东兰县',
            c: '24'
          },
          {
            n: '罗城仫佬族自治县',
            c: '25'
          },
          {
            n: '环江毛南族自治县',
            c: '26'
          },
          {
            n: '巴马瑶族自治县',
            c: '27'
          },
          {
            n: '都安瑶族自治县',
            c: '28'
          },
          {
            n: '大化瑶族自治县',
            c: '29'
          },
          {
            n: '宜州市',
            c: '81'
          }
        ]
      },
      {
        n: '来宾市',
        c: '13',
        city: [
          {
            n: '兴宾区',
            c: '02'
          },
          {
            n: '忻城县',
            c: '21'
          },
          {
            n: '象州县',
            c: '22'
          },
          {
            n: '武宣县',
            c: '23'
          },
          {
            n: '金秀瑶族自治县',
            c: '24'
          },
          {
            n: '合山市',
            c: '81'
          }
        ]
      },
      {
        n: '崇左市',
        c: '14',
        city: [
          {
            n: '江洲区',
            c: '02'
          },
          {
            n: '扶绥县',
            c: '21'
          },
          {
            n: '宁明县',
            c: '22'
          },
          {
            n: '龙州县',
            c: '23'
          },
          {
            n: '大新县',
            c: '24'
          },
          {
            n: '天等县',
            c: '25'
          },
          {
            n: '凭祥市',
            c: '81'
          }
        ]
      }
    ]
  },
  {
    n: '海南',
    c: '46',
    s: [
      {
        n: '海口市',
        c: '01',
        city: [
          {
            n: '秀英区',
            c: '05'
          },
          {
            n: '龙华区',
            c: '06'
          },
          {
            n: '琼山区',
            c: '07'
          },
          {
            n: '美兰区',
            c: '08'
          }
        ]
      },
      {
        n: '三亚市',
        c: '02'
      },
      {
        n: '直辖县级行政单位',
        c: '90',
        city: [
          {
            n: '五指山市',
            c: '01'
          },
          {
            n: '琼海市',
            c: '02'
          },
          {
            n: '儋州市',
            c: '03'
          },
          {
            n: '文昌市',
            c: '05'
          },
          {
            n: '万宁市',
            c: '06'
          },
          {
            n: '东方市',
            c: '07'
          },
          {
            n: '定安县',
            c: '25'
          },
          {
            n: '屯昌县',
            c: '26'
          },
          {
            n: '澄迈县',
            c: '27'
          },
          {
            n: '临高县',
            c: '28'
          },
          {
            n: '白沙黎族自治县',
            c: '30'
          },
          {
            n: '昌江黎族自治县',
            c: '31'
          },
          {
            n: '乐东黎族自治县',
            c: '33'
          },
          {
            n: '陵水黎族自治县',
            c: '34'
          },
          {
            n: '保亭黎族苗族自治县',
            c: '35'
          },
          {
            n: '琼中黎族苗族自治县',
            c: '36'
          },
          {
            n: '西沙群岛',
            c: '37'
          },
          {
            n: '南沙群岛',
            c: '38'
          },
          {
            n: '中沙群岛的岛礁及其海域',
            c: '39'
          }
        ]
      }
    ]
  },
  {
    n: '重庆市',
    c: '50',
    s: [
      {
        n: '市辖区',
        c: '01',
        city: [
          {
            n: '万州区',
            c: '01'
          },
          {
            n: '涪陵区',
            c: '02'
          },
          {
            n: '渝中区',
            c: '03'
          },
          {
            n: '大渡口区',
            c: '04'
          },
          {
            n: '江北区',
            c: '05'
          },
          {
            n: '沙坪坝区',
            c: '06'
          },
          {
            n: '九龙坡区',
            c: '07'
          },
          {
            n: '南岸区',
            c: '08'
          },
          {
            n: '北碚区',
            c: '09'
          },
          {
            n: '万盛区',
            c: '10'
          },
          {
            n: '双桥区',
            c: '11'
          },
          {
            n: '渝北区',
            c: '12'
          },
          {
            n: '巴南区',
            c: '13'
          },
          {
            n: '黔江区',
            c: '14'
          },
          {
            n: '长寿区',
            c: '15'
          },
          {
            n: '江津区',
            c: '16'
          },
          {
            n: '合川区',
            c: '17'
          },
          {
            n: '永川区',
            c: '18'
          },
          {
            n: '南川区',
            c: '19'
          }
        ]
      },
      {
        n: '县',
        c: '02',
        city: [
          {
            n: '綦江县',
            c: '22'
          },
          {
            n: '潼南县',
            c: '23'
          },
          {
            n: '铜梁县',
            c: '24'
          },
          {
            n: '大足县',
            c: '25'
          },
          {
            n: '荣昌县',
            c: '26'
          },
          {
            n: '璧山县',
            c: '27'
          },
          {
            n: '梁平县',
            c: '28'
          },
          {
            n: '城口县',
            c: '29'
          },
          {
            n: '丰都县',
            c: '30'
          },
          {
            n: '垫江县',
            c: '31'
          },
          {
            n: '武隆县',
            c: '32'
          },
          {
            n: '忠县',
            c: '33'
          },
          {
            n: '开县',
            c: '34'
          },
          {
            n: '云阳县',
            c: '35'
          },
          {
            n: '奉节县',
            c: '36'
          },
          {
            n: '巫山县',
            c: '37'
          },
          {
            n: '巫溪县',
            c: '38'
          },
          {
            n: '石柱土家族自治县',
            c: '40'
          },
          {
            n: '秀山土家族苗族自治县',
            c: '41'
          },
          {
            n: '酉阳土家族苗族自治县',
            c: '42'
          },
          {
            n: '彭水苗族土家族自治县',
            c: '43'
          }
        ]
      }
    ]
  },
  {
    n: '四川',
    c: '51',
    s: [
      {
        n: '成都市',
        c: '01',
        city: [
          {
            n: '锦江区',
            c: '04'
          },
          {
            n: '青羊区',
            c: '05'
          },
          {
            n: '金牛区',
            c: '06'
          },
          {
            n: '武侯区',
            c: '07'
          },
          {
            n: '成华区',
            c: '08'
          },
          {
            n: '龙泉驿区',
            c: '12'
          },
          {
            n: '青白江区',
            c: '13'
          },
          {
            n: '新都区',
            c: '14'
          },
          {
            n: '温江区',
            c: '15'
          },
          {
            n: '金堂县',
            c: '21'
          },
          {
            n: '双流县',
            c: '22'
          },
          {
            n: '郫县',
            c: '24'
          },
          {
            n: '大邑县',
            c: '29'
          },
          {
            n: '蒲江县',
            c: '31'
          },
          {
            n: '新津县',
            c: '32'
          },
          {
            n: '都江堰市',
            c: '81'
          },
          {
            n: '彭州市',
            c: '82'
          },
          {
            n: '邛崃市',
            c: '83'
          },
          {
            n: '崇州市',
            c: '84'
          }
        ]
      },
      {
        n: '自贡市',
        c: '03',
        city: [
          {
            n: '自流井区',
            c: '02'
          },
          {
            n: '贡井区',
            c: '03'
          },
          {
            n: '大安区',
            c: '04'
          },
          {
            n: '沿滩区',
            c: '11'
          },
          {
            n: '荣县',
            c: '21'
          },
          {
            n: '富顺县',
            c: '22'
          }
        ]
      },
      {
        n: '攀枝花市',
        c: '04',
        city: [
          {
            n: '东区',
            c: '02'
          },
          {
            n: '西区',
            c: '03'
          },
          {
            n: '仁和区',
            c: '11'
          },
          {
            n: '米易县',
            c: '21'
          },
          {
            n: '盐边县',
            c: '22'
          }
        ]
      },
      {
        n: '泸州市',
        c: '05',
        city: [
          {
            n: '江阳区',
            c: '02'
          },
          {
            n: '纳溪区',
            c: '03'
          },
          {
            n: '龙马潭区',
            c: '04'
          },
          {
            n: '泸县',
            c: '21'
          },
          {
            n: '合江县',
            c: '22'
          },
          {
            n: '叙永县',
            c: '24'
          },
          {
            n: '古蔺县',
            c: '25'
          }
        ]
      },
      {
        n: '德阳市',
        c: '06',
        city: [
          {
            n: '旌阳区',
            c: '03'
          },
          {
            n: '中江县',
            c: '23'
          },
          {
            n: '罗江县',
            c: '26'
          },
          {
            n: '广汉市',
            c: '81'
          },
          {
            n: '什邡市',
            c: '82'
          },
          {
            n: '绵竹市',
            c: '83'
          }
        ]
      },
      {
        n: '绵阳市',
        c: '07',
        city: [
          {
            n: '涪城区',
            c: '03'
          },
          {
            n: '游仙区',
            c: '04'
          },
          {
            n: '三台县',
            c: '22'
          },
          {
            n: '盐亭县',
            c: '23'
          },
          {
            n: '安县',
            c: '24'
          },
          {
            n: '梓潼县',
            c: '25'
          },
          {
            n: '北川羌族自治县',
            c: '26'
          },
          {
            n: '平武县',
            c: '27'
          },
          {
            n: '江油市',
            c: '81'
          }
        ]
      },
      {
        n: '广元市',
        c: '08',
        city: [
          {
            n: '市中区',
            c: '02'
          },
          {
            n: '元坝区',
            c: '11'
          },
          {
            n: '朝天区',
            c: '12'
          },
          {
            n: '旺苍县',
            c: '21'
          },
          {
            n: '青川县',
            c: '22'
          },
          {
            n: '剑阁县',
            c: '23'
          },
          {
            n: '苍溪县',
            c: '24'
          }
        ]
      },
      {
        n: '遂宁市',
        c: '09',
        city: [
          {
            n: '船山区',
            c: '03'
          },
          {
            n: '安居区',
            c: '04'
          },
          {
            n: '蓬溪县',
            c: '21'
          },
          {
            n: '射洪县',
            c: '22'
          },
          {
            n: '大英县',
            c: '23'
          }
        ]
      },
      {
        n: '内江市',
        c: '10',
        city: [
          {
            n: '市中区',
            c: '02'
          },
          {
            n: '东兴区',
            c: '11'
          },
          {
            n: '威远县',
            c: '24'
          },
          {
            n: '资中县',
            c: '25'
          },
          {
            n: '隆昌县',
            c: '28'
          }
        ]
      },
      {
        n: '乐山市',
        c: '11',
        city: [
          {
            n: '市中区',
            c: '02'
          },
          {
            n: '沙湾区',
            c: '11'
          },
          {
            n: '五通桥区',
            c: '12'
          },
          {
            n: '金口河区',
            c: '13'
          },
          {
            n: '犍为县',
            c: '23'
          },
          {
            n: '井研县',
            c: '24'
          },
          {
            n: '夹江县',
            c: '26'
          },
          {
            n: '沐川县',
            c: '29'
          },
          {
            n: '峨边彝族自治县',
            c: '32'
          },
          {
            n: '马边彝族自治县',
            c: '33'
          },
          {
            n: '峨眉山市',
            c: '81'
          }
        ]
      },
      {
        n: '南充市',
        c: '13',
        city: [
          {
            n: '顺庆区',
            c: '02'
          },
          {
            n: '高坪区',
            c: '03'
          },
          {
            n: '嘉陵区',
            c: '04'
          },
          {
            n: '南部县',
            c: '21'
          },
          {
            n: '营山县',
            c: '22'
          },
          {
            n: '蓬安县',
            c: '23'
          },
          {
            n: '仪陇县',
            c: '24'
          },
          {
            n: '西充县',
            c: '25'
          },
          {
            n: '阆中市',
            c: '81'
          }
        ]
      },
      {
        n: '眉山市',
        c: '14',
        city: [
          {
            n: '东坡区',
            c: '02'
          },
          {
            n: '仁寿县',
            c: '21'
          },
          {
            n: '彭山县',
            c: '22'
          },
          {
            n: '洪雅县',
            c: '23'
          },
          {
            n: '丹棱县',
            c: '24'
          },
          {
            n: '青神县',
            c: '25'
          }
        ]
      },
      {
        n: '宜宾市',
        c: '15',
        city: [
          {
            n: '翠屏区',
            c: '02'
          },
          {
            n: '宜宾县',
            c: '21'
          },
          {
            n: '南溪县',
            c: '22'
          },
          {
            n: '江安县',
            c: '23'
          },
          {
            n: '长宁县',
            c: '24'
          },
          {
            n: '高县',
            c: '25'
          },
          {
            n: '珙县',
            c: '26'
          },
          {
            n: '筠连县',
            c: '27'
          },
          {
            n: '兴文县',
            c: '28'
          },
          {
            n: '屏山县',
            c: '29'
          }
        ]
      },
      {
        n: '广安市',
        c: '16',
        city: [
          {
            n: '广安区',
            c: '02'
          },
          {
            n: '岳池县',
            c: '21'
          },
          {
            n: '武胜县',
            c: '22'
          },
          {
            n: '邻水县',
            c: '23'
          },
          {
            n: '华蓥市',
            c: '81'
          }
        ]
      },
      {
        n: '达州市',
        c: '17',
        city: [
          {
            n: '通川区',
            c: '02'
          },
          {
            n: '达县',
            c: '21'
          },
          {
            n: '宣汉县',
            c: '22'
          },
          {
            n: '开江县',
            c: '23'
          },
          {
            n: '大竹县',
            c: '24'
          },
          {
            n: '渠县',
            c: '25'
          },
          {
            n: '万源市',
            c: '81'
          }
        ]
      },
      {
        n: '雅安市',
        c: '18',
        city: [
          {
            n: '雨城区',
            c: '02'
          },
          {
            n: '名山县',
            c: '21'
          },
          {
            n: '荥经县',
            c: '22'
          },
          {
            n: '汉源县',
            c: '23'
          },
          {
            n: '石棉县',
            c: '24'
          },
          {
            n: '天全县',
            c: '25'
          },
          {
            n: '芦山县',
            c: '26'
          },
          {
            n: '宝兴县',
            c: '27'
          }
        ]
      },
      {
        n: '巴中市',
        c: '19',
        city: [
          {
            n: '巴州区',
            c: '02'
          },
          {
            n: '通江县',
            c: '21'
          },
          {
            n: '南江县',
            c: '22'
          },
          {
            n: '平昌县',
            c: '23'
          }
        ]
      },
      {
        n: '资阳市',
        c: '20',
        city: [
          {
            n: '雁江区',
            c: '02'
          },
          {
            n: '安岳县',
            c: '21'
          },
          {
            n: '乐至县',
            c: '22'
          },
          {
            n: '简阳市',
            c: '81'
          }
        ]
      },
      {
        n: '阿坝藏族羌族自治州',
        c: '32',
        city: [
          {
            n: '汶川县',
            c: '21'
          },
          {
            n: '理县',
            c: '22'
          },
          {
            n: '茂县',
            c: '23'
          },
          {
            n: '松潘县',
            c: '24'
          },
          {
            n: '九寨沟县',
            c: '25'
          },
          {
            n: '金川县',
            c: '26'
          },
          {
            n: '小金县',
            c: '27'
          },
          {
            n: '黑水县',
            c: '28'
          },
          {
            n: '马尔康县',
            c: '29'
          },
          {
            n: '壤塘县',
            c: '30'
          },
          {
            n: '阿坝县',
            c: '31'
          },
          {
            n: '若尔盖县',
            c: '32'
          },
          {
            n: '红原县',
            c: '33'
          }
        ]
      },
      {
        n: '甘孜藏族自治州',
        c: '33',
        city: [
          {
            n: '康定县',
            c: '21'
          },
          {
            n: '泸定县',
            c: '22'
          },
          {
            n: '丹巴县',
            c: '23'
          },
          {
            n: '九龙县',
            c: '24'
          },
          {
            n: '雅江县',
            c: '25'
          },
          {
            n: '道孚县',
            c: '26'
          },
          {
            n: '炉霍县',
            c: '27'
          },
          {
            n: '甘孜县',
            c: '28'
          },
          {
            n: '新龙县',
            c: '29'
          },
          {
            n: '德格县',
            c: '30'
          },
          {
            n: '白玉县',
            c: '31'
          },
          {
            n: '石渠县',
            c: '32'
          },
          {
            n: '色达县',
            c: '33'
          },
          {
            n: '理塘县',
            c: '34'
          },
          {
            n: '巴塘县',
            c: '35'
          },
          {
            n: '乡城县',
            c: '36'
          },
          {
            n: '稻城县',
            c: '37'
          },
          {
            n: '得荣县',
            c: '38'
          }
        ]
      },
      {
        n: '凉山彝族自治州',
        c: '34',
        city: [
          {
            n: '西昌市',
            c: '01'
          },
          {
            n: '木里藏族自治县',
            c: '22'
          },
          {
            n: '盐源县',
            c: '23'
          },
          {
            n: '德昌县',
            c: '24'
          },
          {
            n: '会理县',
            c: '25'
          },
          {
            n: '会东县',
            c: '26'
          },
          {
            n: '宁南县',
            c: '27'
          },
          {
            n: '普格县',
            c: '28'
          },
          {
            n: '布拖县',
            c: '29'
          },
          {
            n: '金阳县',
            c: '30'
          },
          {
            n: '昭觉县',
            c: '31'
          },
          {
            n: '喜德县',
            c: '32'
          },
          {
            n: '冕宁县',
            c: '33'
          },
          {
            n: '越西县',
            c: '34'
          },
          {
            n: '甘洛县',
            c: '35'
          },
          {
            n: '美姑县',
            c: '36'
          },
          {
            n: '雷波县',
            c: '37'
          }
        ]
      }
    ]
  },
  {
    n: '贵州',
    c: '52',
    s: [
      {
        n: '贵阳市',
        c: '01',
        city: [
          {
            n: '南明区',
            c: '02'
          },
          {
            n: '云岩区',
            c: '03'
          },
          {
            n: '花溪区',
            c: '11'
          },
          {
            n: '乌当区',
            c: '12'
          },
          {
            n: '白云区',
            c: '13'
          },
          {
            n: '小河区',
            c: '14'
          },
          {
            n: '开阳县',
            c: '21'
          },
          {
            n: '息烽县',
            c: '22'
          },
          {
            n: '修文县',
            c: '23'
          },
          {
            n: '清镇市',
            c: '81'
          }
        ]
      },
      {
        n: '六盘水市',
        c: '02',
        city: [
          {
            n: '钟山区',
            c: '01'
          },
          {
            n: '六枝特区',
            c: '03'
          },
          {
            n: '水城县',
            c: '21'
          },
          {
            n: '盘县',
            c: '22'
          }
        ]
      },
      {
        n: '遵义市',
        c: '03',
        city: [
          {
            n: '红花岗区',
            c: '02'
          },
          {
            n: '汇川区',
            c: '03'
          },
          {
            n: '遵义县',
            c: '21'
          },
          {
            n: '桐梓县',
            c: '22'
          },
          {
            n: '绥阳县',
            c: '23'
          },
          {
            n: '正安县',
            c: '24'
          },
          {
            n: '道真仡佬族苗族自治县',
            c: '25'
          },
          {
            n: '务川仡佬族苗族自治县',
            c: '26'
          },
          {
            n: '凤冈县',
            c: '27'
          },
          {
            n: '湄潭县',
            c: '28'
          },
          {
            n: '余庆县',
            c: '29'
          },
          {
            n: '习水县',
            c: '30'
          },
          {
            n: '赤水市',
            c: '81'
          },
          {
            n: '仁怀市',
            c: '82'
          }
        ]
      },
      {
        n: '安顺市',
        c: '04',
        city: [
          {
            n: '西秀区',
            c: '02'
          },
          {
            n: '平坝县',
            c: '21'
          },
          {
            n: '普定县',
            c: '22'
          },
          {
            n: '镇宁布依族苗族自治县',
            c: '23'
          },
          {
            n: '关岭布依族苗族自治县',
            c: '24'
          },
          {
            n: '紫云苗族布依族自治县',
            c: '25'
          }
        ]
      },
      {
        n: '铜仁地区',
        c: '22',
        city: [
          {
            n: '铜仁市',
            c: '01'
          },
          {
            n: '江口县',
            c: '22'
          },
          {
            n: '玉屏侗族自治县',
            c: '23'
          },
          {
            n: '石阡县',
            c: '24'
          },
          {
            n: '思南县',
            c: '25'
          },
          {
            n: '印江土家族苗族自治县',
            c: '26'
          },
          {
            n: '德江县',
            c: '27'
          },
          {
            n: '沿河土家族自治县',
            c: '28'
          },
          {
            n: '松桃苗族自治县',
            c: '29'
          },
          {
            n: '万山特区',
            c: '30'
          }
        ]
      },
      {
        n: '黔西南布依族苗族自治州',
        c: '23',
        city: [
          {
            n: '兴义市',
            c: '01'
          },
          {
            n: '兴仁县',
            c: '22'
          },
          {
            n: '普安县',
            c: '23'
          },
          {
            n: '晴隆县',
            c: '24'
          },
          {
            n: '贞丰县',
            c: '25'
          },
          {
            n: '望谟县',
            c: '26'
          },
          {
            n: '册亨县',
            c: '27'
          },
          {
            n: '安龙县',
            c: '28'
          }
        ]
      },
      {
        n: '毕节地区',
        c: '24',
        city: [
          {
            n: '毕节市',
            c: '01'
          },
          {
            n: '大方县',
            c: '22'
          },
          {
            n: '黔西县',
            c: '23'
          },
          {
            n: '金沙县',
            c: '24'
          },
          {
            n: '织金县',
            c: '25'
          },
          {
            n: '纳雍县',
            c: '26'
          },
          {
            n: '威宁彝族回族苗族自治县',
            c: '27'
          },
          {
            n: '赫章县',
            c: '28'
          }
        ]
      },
      {
        n: '黔东南苗族侗族自治州',
        c: '26',
        city: [
          {
            n: '凯里市',
            c: '01'
          },
          {
            n: '黄平县',
            c: '22'
          },
          {
            n: '施秉县',
            c: '23'
          },
          {
            n: '三穗县',
            c: '24'
          },
          {
            n: '镇远县',
            c: '25'
          },
          {
            n: '岑巩县',
            c: '26'
          },
          {
            n: '天柱县',
            c: '27'
          },
          {
            n: '锦屏县',
            c: '28'
          },
          {
            n: '剑河县',
            c: '29'
          },
          {
            n: '台江县',
            c: '30'
          },
          {
            n: '黎平县',
            c: '31'
          },
          {
            n: '榕江县',
            c: '32'
          },
          {
            n: '从江县',
            c: '33'
          },
          {
            n: '雷山县',
            c: '34'
          },
          {
            n: '麻江县',
            c: '35'
          },
          {
            n: '丹寨县',
            c: '36'
          }
        ]
      },
      {
        n: '黔南布依族苗族自治州',
        c: '27',
        city: [
          {
            n: '都匀市',
            c: '01'
          },
          {
            n: '福泉市',
            c: '02'
          },
          {
            n: '荔波县',
            c: '22'
          },
          {
            n: '贵定县',
            c: '23'
          },
          {
            n: '瓮安县',
            c: '25'
          },
          {
            n: '独山县',
            c: '26'
          },
          {
            n: '平塘县',
            c: '27'
          },
          {
            n: '罗甸县',
            c: '28'
          },
          {
            n: '长顺县',
            c: '29'
          },
          {
            n: '龙里县',
            c: '30'
          },
          {
            n: '惠水县',
            c: '31'
          },
          {
            n: '三都水族自治县',
            c: '32'
          }
        ]
      }
    ]
  },
  {
    n: '云南',
    c: '53',
    s: [
      {
        n: '昆明市',
        c: '01',
        city: [
          {
            n: '五华区',
            c: '02'
          },
          {
            n: '盘龙区',
            c: '03'
          },
          {
            n: '官渡区',
            c: '11'
          },
          {
            n: '西山区',
            c: '12'
          },
          {
            n: '东川区',
            c: '13'
          },
          {
            n: '呈贡县',
            c: '21'
          },
          {
            n: '晋宁县',
            c: '22'
          },
          {
            n: '富民县',
            c: '24'
          },
          {
            n: '宜良县',
            c: '25'
          },
          {
            n: '石林彝族自治县',
            c: '26'
          },
          {
            n: '嵩明县',
            c: '27'
          },
          {
            n: '禄劝彝族苗族自治县',
            c: '28'
          },
          {
            n: '寻甸回族彝族自治县',
            c: '29'
          },
          {
            n: '安宁市',
            c: '81'
          }
        ]
      },
      {
        n: '曲靖市',
        c: '03',
        city: [
          {
            n: '麒麟区',
            c: '02'
          },
          {
            n: '马龙县',
            c: '21'
          },
          {
            n: '陆良县',
            c: '22'
          },
          {
            n: '师宗县',
            c: '23'
          },
          {
            n: '罗平县',
            c: '24'
          },
          {
            n: '富源县',
            c: '25'
          },
          {
            n: '会泽县',
            c: '26'
          },
          {
            n: '沾益县',
            c: '28'
          },
          {
            n: '宣威市',
            c: '81'
          }
        ]
      },
      {
        n: '玉溪市',
        c: '04',
        city: [
          {
            n: '红塔区',
            c: '02'
          },
          {
            n: '江川县',
            c: '21'
          },
          {
            n: '澄江县',
            c: '22'
          },
          {
            n: '通海县',
            c: '23'
          },
          {
            n: '华宁县',
            c: '24'
          },
          {
            n: '易门县',
            c: '25'
          },
          {
            n: '峨山彝族自治县',
            c: '26'
          },
          {
            n: '新平彝族傣族自治县',
            c: '27'
          },
          {
            n: '元江哈尼族彝族傣族自治县',
            c: '28'
          }
        ]
      },
      {
        n: '保山市',
        c: '05',
        city: [
          {
            n: '隆阳区',
            c: '02'
          },
          {
            n: '施甸县',
            c: '21'
          },
          {
            n: '腾冲县',
            c: '22'
          },
          {
            n: '龙陵县',
            c: '23'
          },
          {
            n: '昌宁县',
            c: '24'
          }
        ]
      },
      {
        n: '昭通市',
        c: '06',
        city: [
          {
            n: '昭阳区',
            c: '02'
          },
          {
            n: '鲁甸县',
            c: '21'
          },
          {
            n: '巧家县',
            c: '22'
          },
          {
            n: '盐津县',
            c: '23'
          },
          {
            n: '大关县',
            c: '24'
          },
          {
            n: '永善县',
            c: '25'
          },
          {
            n: '绥江县',
            c: '26'
          },
          {
            n: '镇雄县',
            c: '27'
          },
          {
            n: '彝良县',
            c: '28'
          },
          {
            n: '威信县',
            c: '29'
          },
          {
            n: '水富县',
            c: '30'
          }
        ]
      },
      {
        n: '丽江市',
        c: '07',
        city: [
          {
            n: '古城区',
            c: '02'
          },
          {
            n: '玉龙纳西族自治县',
            c: '21'
          },
          {
            n: '永胜县',
            c: '22'
          },
          {
            n: '华坪县',
            c: '23'
          },
          {
            n: '宁蒗彝族自治县',
            c: '24'
          }
        ]
      },
      {
        n: '思茅市',
        c: '08',
        city: [
          {
            n: '翠云区',
            c: '02'
          },
          {
            n: '普洱哈尼族彝族自治县',
            c: '21'
          },
          {
            n: '墨江哈尼族自治县',
            c: '22'
          },
          {
            n: '景东彝族自治县',
            c: '23'
          },
          {
            n: '景谷傣族彝族自治县',
            c: '24'
          },
          {
            n: '镇沅彝族哈尼族拉祜族自治县',
            c: '25'
          },
          {
            n: '江城哈尼族彝族自治县',
            c: '26'
          },
          {
            n: '孟连傣族拉祜族佤族自治县',
            c: '27'
          },
          {
            n: '澜沧拉祜族自治县',
            c: '28'
          },
          {
            n: '西盟佤族自治县',
            c: '29'
          }
        ]
      },
      {
        n: '临沧市',
        c: '09',
        city: [
          {
            n: '临翔区',
            c: '02'
          },
          {
            n: '凤庆县',
            c: '21'
          },
          {
            n: '云县',
            c: '22'
          },
          {
            n: '永德县',
            c: '23'
          },
          {
            n: '镇康县',
            c: '24'
          },
          {
            n: '双江拉祜族佤族布朗族傣族自治县',
            c: '25'
          },
          {
            n: '耿马傣族佤族自治县',
            c: '26'
          },
          {
            n: '沧源佤族自治县',
            c: '27'
          }
        ]
      },
      {
        n: '楚雄彝族自治州',
        c: '23',
        city: [
          {
            n: '楚雄市',
            c: '01'
          },
          {
            n: '双柏县',
            c: '22'
          },
          {
            n: '牟定县',
            c: '23'
          },
          {
            n: '南华县',
            c: '24'
          },
          {
            n: '姚安县',
            c: '25'
          },
          {
            n: '大姚县',
            c: '26'
          },
          {
            n: '永仁县',
            c: '27'
          },
          {
            n: '元谋县',
            c: '28'
          },
          {
            n: '武定县',
            c: '29'
          },
          {
            n: '禄丰县',
            c: '31'
          }
        ]
      },
      {
        n: '红河哈尼族彝族自治州',
        c: '25',
        city: [
          {
            n: '个旧市',
            c: '01'
          },
          {
            n: '开远市',
            c: '02'
          },
          {
            n: '蒙自县',
            c: '22'
          },
          {
            n: '屏边苗族自治县',
            c: '23'
          },
          {
            n: '建水县',
            c: '24'
          },
          {
            n: '石屏县',
            c: '25'
          },
          {
            n: '弥勒县',
            c: '26'
          },
          {
            n: '泸西县',
            c: '27'
          },
          {
            n: '元阳县',
            c: '28'
          },
          {
            n: '红河县',
            c: '29'
          },
          {
            n: '金平苗族瑶族傣族自治县',
            c: '30'
          },
          {
            n: '绿春县',
            c: '31'
          },
          {
            n: '河口瑶族自治县',
            c: '32'
          }
        ]
      },
      {
        n: '文山壮族苗族自治州',
        c: '26',
        city: [
          {
            n: '文山县',
            c: '21'
          },
          {
            n: '砚山县',
            c: '22'
          },
          {
            n: '西畴县',
            c: '23'
          },
          {
            n: '麻栗坡县',
            c: '24'
          },
          {
            n: '马关县',
            c: '25'
          },
          {
            n: '丘北县',
            c: '26'
          },
          {
            n: '广南县',
            c: '27'
          },
          {
            n: '富宁县',
            c: '28'
          }
        ]
      },
      {
        n: '西双版纳傣族自治州',
        c: '28',
        city: [
          {
            n: '景洪市',
            c: '01'
          },
          {
            n: '勐海县',
            c: '22'
          },
          {
            n: '勐腊县',
            c: '23'
          }
        ]
      },
      {
        n: '大理白族自治州',
        c: '29',
        city: [
          {
            n: '大理市',
            c: '01'
          },
          {
            n: '漾濞彝族自治县',
            c: '22'
          },
          {
            n: '祥云县',
            c: '23'
          },
          {
            n: '宾川县',
            c: '24'
          },
          {
            n: '弥渡县',
            c: '25'
          },
          {
            n: '南涧彝族自治县',
            c: '26'
          },
          {
            n: '巍山彝族回族自治县',
            c: '27'
          },
          {
            n: '永平县',
            c: '28'
          },
          {
            n: '云龙县',
            c: '29'
          },
          {
            n: '洱源县',
            c: '30'
          },
          {
            n: '剑川县',
            c: '31'
          },
          {
            n: '鹤庆县',
            c: '32'
          }
        ]
      },
      {
        n: '德宏傣族景颇族自治州',
        c: '31',
        city: [
          {
            n: '瑞丽市',
            c: '02'
          },
          {
            n: '潞西市',
            c: '03'
          },
          {
            n: '梁河县',
            c: '22'
          },
          {
            n: '盈江县',
            c: '23'
          },
          {
            n: '陇川县',
            c: '24'
          }
        ]
      },
      {
        n: '怒江傈僳族自治州',
        c: '33',
        city: [
          {
            n: '泸水县',
            c: '21'
          },
          {
            n: '福贡县',
            c: '23'
          },
          {
            n: '贡山独龙族怒族自治县',
            c: '24'
          },
          {
            n: '兰坪白族普米族自治县',
            c: '25'
          }
        ]
      },
      {
        n: '迪庆藏族自治州',
        c: '34',
        city: [
          {
            n: '香格里拉县',
            c: '21'
          },
          {
            n: '德钦县',
            c: '22'
          },
          {
            n: '维西傈僳族自治县',
            c: '23'
          }
        ]
      }
    ]
  },
  {
    n: '西藏',
    c: '54',
    s: [
      {
        n: '拉萨市',
        c: '01',
        city: [
          {
            n: '城关区',
            c: '02'
          },
          {
            n: '林周县',
            c: '21'
          },
          {
            n: '当雄县',
            c: '22'
          },
          {
            n: '尼木县',
            c: '23'
          },
          {
            n: '曲水县',
            c: '24'
          },
          {
            n: '堆龙德庆县',
            c: '25'
          },
          {
            n: '达孜县',
            c: '26'
          },
          {
            n: '墨竹工卡县',
            c: '27'
          }
        ]
      },
      {
        n: '昌都地区',
        c: '21',
        city: [
          {
            n: '昌都县',
            c: '21'
          },
          {
            n: '江达县',
            c: '22'
          },
          {
            n: '贡觉县',
            c: '23'
          },
          {
            n: '类乌齐县',
            c: '24'
          },
          {
            n: '丁青县',
            c: '25'
          },
          {
            n: '察雅县',
            c: '26'
          },
          {
            n: '八宿县',
            c: '27'
          },
          {
            n: '左贡县',
            c: '28'
          },
          {
            n: '芒康县',
            c: '29'
          },
          {
            n: '洛隆县',
            c: '32'
          },
          {
            n: '边坝县',
            c: '33'
          }
        ]
      },
      {
        n: '山南地区',
        c: '22',
        city: [
          {
            n: '乃东县',
            c: '21'
          },
          {
            n: '扎囊县',
            c: '22'
          },
          {
            n: '贡嘎县',
            c: '23'
          },
          {
            n: '桑日县',
            c: '24'
          },
          {
            n: '琼结县',
            c: '25'
          },
          {
            n: '曲松县',
            c: '26'
          },
          {
            n: '措美县',
            c: '27'
          },
          {
            n: '洛扎县',
            c: '28'
          },
          {
            n: '加查县',
            c: '29'
          },
          {
            n: '隆子县',
            c: '31'
          },
          {
            n: '错那县',
            c: '32'
          },
          {
            n: '浪卡子县',
            c: '33'
          }
        ]
      },
      {
        n: '日喀则地区',
        c: '23',
        city: [
          {
            n: '日喀则市',
            c: '01'
          },
          {
            n: '南木林县',
            c: '22'
          },
          {
            n: '江孜县',
            c: '23'
          },
          {
            n: '定日县',
            c: '24'
          },
          {
            n: '萨迦县',
            c: '25'
          },
          {
            n: '拉孜县',
            c: '26'
          },
          {
            n: '昂仁县',
            c: '27'
          },
          {
            n: '谢通门县',
            c: '28'
          },
          {
            n: '白朗县',
            c: '29'
          },
          {
            n: '仁布县',
            c: '30'
          },
          {
            n: '康马县',
            c: '31'
          },
          {
            n: '定结县',
            c: '32'
          },
          {
            n: '仲巴县',
            c: '33'
          },
          {
            n: '亚东县',
            c: '34'
          },
          {
            n: '吉隆县',
            c: '35'
          },
          {
            n: '聂拉木县',
            c: '36'
          },
          {
            n: '萨嘎县',
            c: '37'
          },
          {
            n: '岗巴县',
            c: '38'
          }
        ]
      },
      {
        n: '那曲地区',
        c: '24',
        city: [
          {
            n: '那曲县',
            c: '21'
          },
          {
            n: '嘉黎县',
            c: '22'
          },
          {
            n: '比如县',
            c: '23'
          },
          {
            n: '聂荣县',
            c: '24'
          },
          {
            n: '安多县',
            c: '25'
          },
          {
            n: '申扎县',
            c: '26'
          },
          {
            n: '索县',
            c: '27'
          },
          {
            n: '班戈县',
            c: '28'
          },
          {
            n: '巴青县',
            c: '29'
          },
          {
            n: '尼玛县',
            c: '30'
          }
        ]
      },
      {
        n: '阿里地区',
        c: '25',
        city: [
          {
            n: '普兰县',
            c: '21'
          },
          {
            n: '札达县',
            c: '22'
          },
          {
            n: '噶尔县',
            c: '23'
          },
          {
            n: '日土县',
            c: '24'
          },
          {
            n: '革吉县',
            c: '25'
          },
          {
            n: '改则县',
            c: '26'
          },
          {
            n: '措勤县',
            c: '27'
          }
        ]
      },
      {
        n: '林芝地区',
        c: '26',
        city: [
          {
            n: '林芝县',
            c: '21'
          },
          {
            n: '工布江达县',
            c: '22'
          },
          {
            n: '米林县',
            c: '23'
          },
          {
            n: '墨脱县',
            c: '24'
          },
          {
            n: '波密县',
            c: '25'
          },
          {
            n: '察隅县',
            c: '26'
          },
          {
            n: '朗县',
            c: '27'
          }
        ]
      }
    ]
  },
  {
    n: '陕西',
    c: '61',
    s: [
      {
        n: '西安市',
        c: '01',
        city: [
          {
            n: '新城区',
            c: '02'
          },
          {
            n: '碑林区',
            c: '03'
          },
          {
            n: '莲湖区',
            c: '04'
          },
          {
            n: '灞桥区',
            c: '11'
          },
          {
            n: '未央区',
            c: '12'
          },
          {
            n: '雁塔区',
            c: '13'
          },
          {
            n: '阎良区',
            c: '14'
          },
          {
            n: '临潼区',
            c: '15'
          },
          {
            n: '长安区',
            c: '16'
          },
          {
            n: '蓝田县',
            c: '22'
          },
          {
            n: '周至县',
            c: '24'
          },
          {
            n: '户县',
            c: '25'
          },
          {
            n: '高陵县',
            c: '26'
          }
        ]
      },
      {
        n: '铜川市',
        c: '02',
        city: [
          {
            n: '王益区',
            c: '02'
          },
          {
            n: '印台区',
            c: '03'
          },
          {
            n: '耀州区',
            c: '04'
          },
          {
            n: '宜君县',
            c: '22'
          }
        ]
      },
      {
        n: '宝鸡市',
        c: '03',
        city: [
          {
            n: '渭滨区',
            c: '02'
          },
          {
            n: '金台区',
            c: '03'
          },
          {
            n: '陈仓区',
            c: '04'
          },
          {
            n: '凤翔县',
            c: '22'
          },
          {
            n: '岐山县',
            c: '23'
          },
          {
            n: '扶风县',
            c: '24'
          },
          {
            n: '眉县',
            c: '26'
          },
          {
            n: '陇县',
            c: '27'
          },
          {
            n: '千阳县',
            c: '28'
          },
          {
            n: '麟游县',
            c: '29'
          },
          {
            n: '凤县',
            c: '30'
          },
          {
            n: '太白县',
            c: '31'
          }
        ]
      },
      {
        n: '咸阳市',
        c: '04',
        city: [
          {
            n: '秦都区',
            c: '02'
          },
          {
            n: '杨凌区',
            c: '03'
          },
          {
            n: '渭城区',
            c: '04'
          },
          {
            n: '三原县',
            c: '22'
          },
          {
            n: '泾阳县',
            c: '23'
          },
          {
            n: '乾县',
            c: '24'
          },
          {
            n: '礼泉县',
            c: '25'
          },
          {
            n: '永寿县',
            c: '26'
          },
          {
            n: '彬县',
            c: '27'
          },
          {
            n: '长武县',
            c: '28'
          },
          {
            n: '旬邑县',
            c: '29'
          },
          {
            n: '淳化县',
            c: '30'
          },
          {
            n: '武功县',
            c: '31'
          },
          {
            n: '兴平市',
            c: '81'
          }
        ]
      },
      {
        n: '渭南市',
        c: '05',
        city: [
          {
            n: '临渭区',
            c: '02'
          },
          {
            n: '华县',
            c: '21'
          },
          {
            n: '潼关县',
            c: '22'
          },
          {
            n: '大荔县',
            c: '23'
          },
          {
            n: '合阳县',
            c: '24'
          },
          {
            n: '澄城县',
            c: '25'
          },
          {
            n: '蒲城县',
            c: '26'
          },
          {
            n: '白水县',
            c: '27'
          },
          {
            n: '富平县',
            c: '28'
          },
          {
            n: '韩城市',
            c: '81'
          },
          {
            n: '华阴市',
            c: '82'
          }
        ]
      },
      {
        n: '延安市',
        c: '06',
        city: [
          {
            n: '宝塔区',
            c: '02'
          },
          {
            n: '延长县',
            c: '21'
          },
          {
            n: '延川县',
            c: '22'
          },
          {
            n: '子长县',
            c: '23'
          },
          {
            n: '安塞县',
            c: '24'
          },
          {
            n: '志丹县',
            c: '25'
          },
          {
            n: '吴起县',
            c: '26'
          },
          {
            n: '甘泉县',
            c: '27'
          },
          {
            n: '富县',
            c: '28'
          },
          {
            n: '洛川县',
            c: '29'
          },
          {
            n: '宜川县',
            c: '30'
          },
          {
            n: '黄龙县',
            c: '31'
          },
          {
            n: '黄陵县',
            c: '32'
          }
        ]
      },
      {
        n: '汉中市',
        c: '07',
        city: [
          {
            n: '汉台区',
            c: '02'
          },
          {
            n: '南郑县',
            c: '21'
          },
          {
            n: '城固县',
            c: '22'
          },
          {
            n: '洋县',
            c: '23'
          },
          {
            n: '西乡县',
            c: '24'
          },
          {
            n: '勉县',
            c: '25'
          },
          {
            n: '宁强县',
            c: '26'
          },
          {
            n: '略阳县',
            c: '27'
          },
          {
            n: '镇巴县',
            c: '28'
          },
          {
            n: '留坝县',
            c: '29'
          },
          {
            n: '佛坪县',
            c: '30'
          }
        ]
      },
      {
        n: '榆林市',
        c: '08',
        city: [
          {
            n: '榆阳区',
            c: '02'
          },
          {
            n: '神木县',
            c: '21'
          },
          {
            n: '府谷县',
            c: '22'
          },
          {
            n: '横山县',
            c: '23'
          },
          {
            n: '靖边县',
            c: '24'
          },
          {
            n: '定边县',
            c: '25'
          },
          {
            n: '绥德县',
            c: '26'
          },
          {
            n: '米脂县',
            c: '27'
          },
          {
            n: '佳县',
            c: '28'
          },
          {
            n: '吴堡县',
            c: '29'
          },
          {
            n: '清涧县',
            c: '30'
          },
          {
            n: '子洲县',
            c: '31'
          }
        ]
      },
      {
        n: '安康市',
        c: '09',
        city: [
          {
            n: '汉滨区',
            c: '02'
          },
          {
            n: '汉阴县',
            c: '21'
          },
          {
            n: '石泉县',
            c: '22'
          },
          {
            n: '宁陕县',
            c: '23'
          },
          {
            n: '紫阳县',
            c: '24'
          },
          {
            n: '岚皋县',
            c: '25'
          },
          {
            n: '平利县',
            c: '26'
          },
          {
            n: '镇坪县',
            c: '27'
          },
          {
            n: '旬阳县',
            c: '28'
          },
          {
            n: '白河县',
            c: '29'
          }
        ]
      },
      {
        n: '商洛市',
        c: '10',
        city: [
          {
            n: '商州区',
            c: '02'
          },
          {
            n: '洛南县',
            c: '21'
          },
          {
            n: '丹凤县',
            c: '22'
          },
          {
            n: '商南县',
            c: '23'
          },
          {
            n: '山阳县',
            c: '24'
          },
          {
            n: '镇安县',
            c: '25'
          },
          {
            n: '柞水县',
            c: '26'
          }
        ]
      }
    ]
  },
  {
    n: '甘肃',
    c: '62',
    s: [
      {
        n: '兰州市',
        c: '01',
        city: [
          {
            n: '城关区',
            c: '02'
          },
          {
            n: '七里河区',
            c: '03'
          },
          {
            n: '西固区',
            c: '04'
          },
          {
            n: '安宁区',
            c: '05'
          },
          {
            n: '红古区',
            c: '11'
          },
          {
            n: '永登县',
            c: '21'
          },
          {
            n: '皋兰县',
            c: '22'
          },
          {
            n: '榆中县',
            c: '23'
          }
        ]
      },
      {
        n: '嘉峪关市',
        c: '02'
      },
      {
        n: '金昌市',
        c: '03',
        city: [
          {
            n: '金川区',
            c: '02'
          },
          {
            n: '永昌县',
            c: '21'
          }
        ]
      },
      {
        n: '白银市',
        c: '04',
        city: [
          {
            n: '白银区',
            c: '02'
          },
          {
            n: '平川区',
            c: '03'
          },
          {
            n: '靖远县',
            c: '21'
          },
          {
            n: '会宁县',
            c: '22'
          },
          {
            n: '景泰县',
            c: '23'
          }
        ]
      },
      {
        n: '天水市',
        c: '05',
        city: [
          {
            n: '秦城区',
            c: '02'
          },
          {
            n: '北道区',
            c: '03'
          },
          {
            n: '清水县',
            c: '21'
          },
          {
            n: '秦安县',
            c: '22'
          },
          {
            n: '甘谷县',
            c: '23'
          },
          {
            n: '武山县',
            c: '24'
          },
          {
            n: '张家川回族自治县',
            c: '25'
          }
        ]
      },
      {
        n: '武威市',
        c: '06',
        city: [
          {
            n: '凉州区',
            c: '02'
          },
          {
            n: '民勤县',
            c: '21'
          },
          {
            n: '古浪县',
            c: '22'
          },
          {
            n: '天祝藏族自治县',
            c: '23'
          }
        ]
      },
      {
        n: '张掖市',
        c: '07',
        city: [
          {
            n: '甘州区',
            c: '02'
          },
          {
            n: '肃南裕固族自治县',
            c: '21'
          },
          {
            n: '民乐县',
            c: '22'
          },
          {
            n: '临泽县',
            c: '23'
          },
          {
            n: '高台县',
            c: '24'
          },
          {
            n: '山丹县',
            c: '25'
          }
        ]
      },
      {
        n: '平凉市',
        c: '08',
        city: [
          {
            n: '崆峒区',
            c: '02'
          },
          {
            n: '泾川县',
            c: '21'
          },
          {
            n: '灵台县',
            c: '22'
          },
          {
            n: '崇信县',
            c: '23'
          },
          {
            n: '华亭县',
            c: '24'
          },
          {
            n: '庄浪县',
            c: '25'
          },
          {
            n: '静宁县',
            c: '26'
          }
        ]
      },
      {
        n: '酒泉市',
        c: '09',
        city: [
          {
            n: '肃州区',
            c: '02'
          },
          {
            n: '金塔县',
            c: '21'
          },
          {
            n: '瓜州县',
            c: '22'
          },
          {
            n: '肃北蒙古族自治县',
            c: '23'
          },
          {
            n: '阿克塞哈萨克族自治县',
            c: '24'
          },
          {
            n: '玉门市',
            c: '81'
          },
          {
            n: '敦煌市',
            c: '82'
          }
        ]
      },
      {
        n: '庆阳市',
        c: '10',
        city: [
          {
            n: '西峰区',
            c: '02'
          },
          {
            n: '庆城县',
            c: '21'
          },
          {
            n: '环县',
            c: '22'
          },
          {
            n: '华池县',
            c: '23'
          },
          {
            n: '合水县',
            c: '24'
          },
          {
            n: '正宁县',
            c: '25'
          },
          {
            n: '宁县',
            c: '26'
          },
          {
            n: '镇原县',
            c: '27'
          }
        ]
      },
      {
        n: '定西市',
        c: '11',
        city: [
          {
            n: '安定区',
            c: '02'
          },
          {
            n: '通渭县',
            c: '21'
          },
          {
            n: '陇西县',
            c: '22'
          },
          {
            n: '渭源县',
            c: '23'
          },
          {
            n: '临洮县',
            c: '24'
          },
          {
            n: '漳县',
            c: '25'
          },
          {
            n: '岷县',
            c: '26'
          }
        ]
      },
      {
        n: '陇南市',
        c: '12',
        city: [
          {
            n: '武都区',
            c: '02'
          },
          {
            n: '成县',
            c: '21'
          },
          {
            n: '文县',
            c: '22'
          },
          {
            n: '宕昌县',
            c: '23'
          },
          {
            n: '康县',
            c: '24'
          },
          {
            n: '西和县',
            c: '25'
          },
          {
            n: '礼县',
            c: '26'
          },
          {
            n: '徽县',
            c: '27'
          },
          {
            n: '两当县',
            c: '28'
          }
        ]
      },
      {
        n: '临夏回族自治州',
        c: '29',
        city: [
          {
            n: '临夏市',
            c: '01'
          },
          {
            n: '临夏县',
            c: '21'
          },
          {
            n: '康乐县',
            c: '22'
          },
          {
            n: '永靖县',
            c: '23'
          },
          {
            n: '广河县',
            c: '24'
          },
          {
            n: '和政县',
            c: '25'
          },
          {
            n: '东乡族自治县',
            c: '26'
          },
          {
            n: '积石山保安族东乡族撒拉族自治县',
            c: '27'
          }
        ]
      },
      {
        n: '甘南藏族自治州',
        c: '30',
        city: [
          {
            n: '合作市',
            c: '01'
          },
          {
            n: '临潭县',
            c: '21'
          },
          {
            n: '卓尼县',
            c: '22'
          },
          {
            n: '舟曲县',
            c: '23'
          },
          {
            n: '迭部县',
            c: '24'
          },
          {
            n: '玛曲县',
            c: '25'
          },
          {
            n: '碌曲县',
            c: '26'
          },
          {
            n: '夏河县',
            c: '27'
          }
        ]
      }
    ]
  },
  {
    n: '青海',
    c: '63',
    s: [
      {
        n: '西宁市',
        c: '01',
        city: [
          {
            n: '城东区',
            c: '02'
          },
          {
            n: '城中区',
            c: '03'
          },
          {
            n: '城西区',
            c: '04'
          },
          {
            n: '城北区',
            c: '05'
          },
          {
            n: '大通回族土族自治县',
            c: '21'
          },
          {
            n: '湟中县',
            c: '22'
          },
          {
            n: '湟源县',
            c: '23'
          }
        ]
      },
      {
        n: '海东地区',
        c: '21',
        city: [
          {
            n: '平安县',
            c: '21'
          },
          {
            n: '民和回族土族自治县',
            c: '22'
          },
          {
            n: '乐都县',
            c: '23'
          },
          {
            n: '互助土族自治县',
            c: '26'
          },
          {
            n: '化隆回族自治县',
            c: '27'
          },
          {
            n: '循化撒拉族自治县',
            c: '28'
          }
        ]
      },
      {
        n: '海北藏族自治州',
        c: '22',
        city: [
          {
            n: '门源回族自治县',
            c: '21'
          },
          {
            n: '祁连县',
            c: '22'
          },
          {
            n: '海晏县',
            c: '23'
          },
          {
            n: '刚察县',
            c: '24'
          }
        ]
      },
      {
        n: '黄南藏族自治州',
        c: '23',
        city: [
          {
            n: '同仁县',
            c: '21'
          },
          {
            n: '尖扎县',
            c: '22'
          },
          {
            n: '泽库县',
            c: '23'
          },
          {
            n: '河南蒙古族自治县',
            c: '24'
          }
        ]
      },
      {
        n: '海南藏族自治州',
        c: '25',
        city: [
          {
            n: '共和县',
            c: '21'
          },
          {
            n: '同德县',
            c: '22'
          },
          {
            n: '贵德县',
            c: '23'
          },
          {
            n: '兴海县',
            c: '24'
          },
          {
            n: '贵南县',
            c: '25'
          }
        ]
      },
      {
        n: '果洛藏族自治州',
        c: '26',
        city: [
          {
            n: '玛沁县',
            c: '21'
          },
          {
            n: '班玛县',
            c: '22'
          },
          {
            n: '甘德县',
            c: '23'
          },
          {
            n: '达日县',
            c: '24'
          },
          {
            n: '久治县',
            c: '25'
          },
          {
            n: '玛多县',
            c: '26'
          }
        ]
      },
      {
        n: '玉树藏族自治州',
        c: '27',
        city: [
          {
            n: '玉树县',
            c: '21'
          },
          {
            n: '杂多县',
            c: '22'
          },
          {
            n: '称多县',
            c: '23'
          },
          {
            n: '治多县',
            c: '24'
          },
          {
            n: '囊谦县',
            c: '25'
          },
          {
            n: '曲麻莱县',
            c: '26'
          }
        ]
      },
      {
        n: '海西蒙古族藏族自治州',
        c: '28',
        city: [
          {
            n: '格尔木市',
            c: '01'
          },
          {
            n: '德令哈市',
            c: '02'
          },
          {
            n: '乌兰县',
            c: '21'
          },
          {
            n: '都兰县',
            c: '22'
          },
          {
            n: '天峻县',
            c: '23'
          }
        ]
      }
    ]
  },
  {
    n: '宁夏',
    c: '64',
    s: [
      {
        n: '银川市',
        c: '01',
        city: [
          {
            n: '兴庆区',
            c: '04'
          },
          {
            n: '西夏区',
            c: '05'
          },
          {
            n: '金凤区',
            c: '06'
          },
          {
            n: '永宁县',
            c: '21'
          },
          {
            n: '贺兰县',
            c: '22'
          },
          {
            n: '灵武市',
            c: '81'
          }
        ]
      },
      {
        n: '石嘴山市',
        c: '02',
        city: [
          {
            n: '大武口区',
            c: '02'
          },
          {
            n: '惠农区',
            c: '05'
          },
          {
            n: '平罗县',
            c: '21'
          }
        ]
      },
      {
        n: '吴忠市',
        c: '03',
        city: [
          {
            n: '利通区',
            c: '02'
          },
          {
            n: '盐池县',
            c: '23'
          },
          {
            n: '同心县',
            c: '24'
          },
          {
            n: '青铜峡市',
            c: '81'
          }
        ]
      },
      {
        n: '固原市',
        c: '04',
        city: [
          {
            n: '原州区',
            c: '02'
          },
          {
            n: '西吉县',
            c: '22'
          },
          {
            n: '隆德县',
            c: '23'
          },
          {
            n: '泾源县',
            c: '24'
          },
          {
            n: '彭阳县',
            c: '25'
          }
        ]
      },
      {
        n: '中卫市',
        c: '05',
        city: [
          {
            n: '沙坡头区',
            c: '02'
          },
          {
            n: '中宁县',
            c: '21'
          },
          {
            n: '海原县',
            c: '22'
          }
        ]
      }
    ]
  },
  {
    n: '新疆',
    c: '65',
    s: [
      {
        n: '乌鲁木齐市',
        c: '01',
        city: [
          {
            n: '天山区',
            c: '02'
          },
          {
            n: '沙依巴克区',
            c: '03'
          },
          {
            n: '新市区',
            c: '04'
          },
          {
            n: '水磨沟区',
            c: '05'
          },
          {
            n: '头屯河区',
            c: '06'
          },
          {
            n: '达坂城区',
            c: '07'
          },
          {
            n: '东山区',
            c: '08'
          },
          {
            n: '乌鲁木齐县',
            c: '21'
          }
        ]
      },
      {
        n: '克拉玛依市',
        c: '02',
        city: [
          {
            n: '独山子区',
            c: '02'
          },
          {
            n: '克拉玛依区',
            c: '03'
          },
          {
            n: '白碱滩区',
            c: '04'
          },
          {
            n: '乌尔禾区',
            c: '05'
          }
        ]
      },
      {
        n: '吐鲁番地区',
        c: '21',
        city: [
          {
            n: '吐鲁番市',
            c: '01'
          },
          {
            n: '鄯善县',
            c: '22'
          },
          {
            n: '托克逊县',
            c: '23'
          }
        ]
      },
      {
        n: '哈密地区',
        c: '22',
        city: [
          {
            n: '哈密市',
            c: '01'
          },
          {
            n: '巴里坤哈萨克自治县',
            c: '22'
          },
          {
            n: '伊吾县',
            c: '23'
          }
        ]
      },
      {
        n: '昌吉回族自治州',
        c: '23',
        city: [
          {
            n: '昌吉市',
            c: '01'
          },
          {
            n: '阜康市',
            c: '02'
          },
          {
            n: '米泉市',
            c: '03'
          },
          {
            n: '呼图壁县',
            c: '23'
          },
          {
            n: '玛纳斯县',
            c: '24'
          },
          {
            n: '奇台县',
            c: '25'
          },
          {
            n: '吉木萨尔县',
            c: '27'
          },
          {
            n: '木垒哈萨克自治县',
            c: '28'
          }
        ]
      },
      {
        n: '博尔塔拉蒙古自治州',
        c: '27',
        city: [
          {
            n: '博乐市',
            c: '01'
          },
          {
            n: '精河县',
            c: '22'
          },
          {
            n: '温泉县',
            c: '23'
          }
        ]
      },
      {
        n: '巴音郭楞蒙古自治州',
        c: '28',
        city: [
          {
            n: '库尔勒市',
            c: '01'
          },
          {
            n: '轮台县',
            c: '22'
          },
          {
            n: '尉犁县',
            c: '23'
          },
          {
            n: '若羌县',
            c: '24'
          },
          {
            n: '且末县',
            c: '25'
          },
          {
            n: '焉耆回族自治县',
            c: '26'
          },
          {
            n: '和静县',
            c: '27'
          },
          {
            n: '和硕县',
            c: '28'
          },
          {
            n: '博湖县',
            c: '29'
          }
        ]
      },
      {
        n: '阿克苏地区',
        c: '29',
        city: [
          {
            n: '阿克苏市',
            c: '01'
          },
          {
            n: '温宿县',
            c: '22'
          },
          {
            n: '库车县',
            c: '23'
          },
          {
            n: '沙雅县',
            c: '24'
          },
          {
            n: '新和县',
            c: '25'
          },
          {
            n: '拜城县',
            c: '26'
          },
          {
            n: '乌什县',
            c: '27'
          },
          {
            n: '阿瓦提县',
            c: '28'
          },
          {
            n: '柯坪县',
            c: '29'
          }
        ]
      },
      {
        n: '克孜勒苏柯尔克孜自治州',
        c: '30',
        city: [
          {
            n: '阿图什市',
            c: '01'
          },
          {
            n: '阿克陶县',
            c: '22'
          },
          {
            n: '阿合奇县',
            c: '23'
          },
          {
            n: '乌恰县',
            c: '24'
          }
        ]
      },
      {
        n: '喀什地区',
        c: '31',
        city: [
          {
            n: '喀什市',
            c: '01'
          },
          {
            n: '疏附县',
            c: '21'
          },
          {
            n: '疏勒县',
            c: '22'
          },
          {
            n: '英吉沙县',
            c: '23'
          },
          {
            n: '泽普县',
            c: '24'
          },
          {
            n: '莎车县',
            c: '25'
          },
          {
            n: '叶城县',
            c: '26'
          },
          {
            n: '麦盖提县',
            c: '27'
          },
          {
            n: '岳普湖县',
            c: '28'
          },
          {
            n: '伽师县',
            c: '29'
          },
          {
            n: '巴楚县',
            c: '30'
          },
          {
            n: '塔什库尔干塔吉克自治县',
            c: '31'
          }
        ]
      },
      {
        n: '和田地区',
        c: '32',
        city: [
          {
            n: '和田市',
            c: '01'
          },
          {
            n: '和田县',
            c: '21'
          },
          {
            n: '墨玉县',
            c: '22'
          },
          {
            n: '皮山县',
            c: '23'
          },
          {
            n: '洛浦县',
            c: '24'
          },
          {
            n: '策勒县',
            c: '25'
          },
          {
            n: '于田县',
            c: '26'
          },
          {
            n: '民丰县',
            c: '27'
          }
        ]
      },
      {
        n: '伊犁哈萨克',
        c: '40',
        city: [
          {
            n: '伊宁市',
            c: '02'
          },
          {
            n: '奎屯市',
            c: '03'
          },
          {
            n: '伊宁县',
            c: '21'
          },
          {
            n: '察布查尔锡伯自治县',
            c: '22'
          },
          {
            n: '霍城县',
            c: '23'
          },
          {
            n: '巩留县',
            c: '24'
          },
          {
            n: '新源县',
            c: '25'
          },
          {
            n: '昭苏县',
            c: '26'
          },
          {
            n: '特克斯县',
            c: '27'
          },
          {
            n: '尼勒克县',
            c: '28'
          }
        ]
      },
      {
        n: '塔城地区',
        c: '42',
        city: [
          {
            n: '塔城市',
            c: '01'
          },
          {
            n: '乌苏市',
            c: '02'
          },
          {
            n: '额敏县',
            c: '21'
          },
          {
            n: '沙湾县',
            c: '23'
          },
          {
            n: '托里县',
            c: '24'
          },
          {
            n: '裕民县',
            c: '25'
          },
          {
            n: '和布克赛尔蒙古自治县',
            c: '26'
          }
        ]
      },
      {
        n: '阿勒泰地区',
        c: '43',
        city: [
          {
            n: '阿勒泰市',
            c: '01'
          },
          {
            n: '布尔津县',
            c: '21'
          },
          {
            n: '富蕴县',
            c: '22'
          },
          {
            n: '福海县',
            c: '23'
          },
          {
            n: '哈巴河县',
            c: '24'
          },
          {
            n: '青河县',
            c: '25'
          },
          {
            n: '吉木乃县',
            c: '26'
          }
        ]
      },
      {
        n: '石河子市',
        c: '91'
      },
      {
        n: '阿拉尔市',
        c: '92'
      },
      {
        n: '图木舒克市',
        c: '93'
      },
      {
        n: '五家渠市',
        c: '94'
      }
    ]
  },
  {
    n: '台湾',
    c: '71',
    s: [
      {
        n: '台北',
        c: '01'
      },
      {
        n: '高雄',
        c: '02'
      },
      {
        n: '基隆',
        c: '03'
      },
      {
        n: '台中',
        c: '04'
      },
      {
        n: '台南',
        c: '05'
      },
      {
        n: '新竹',
        c: '06'
      },
      {
        n: '嘉义',
        c: '07'
      },
      {
        n: '宜兰',
        c: '08'
      },
      {
        n: '桃园',
        c: '09'
      },
      {
        n: '苗栗',
        c: '10'
      },
      {
        n: '彰化',
        c: '11'
      },
      {
        n: '南投',
        c: '12'
      },
      {
        n: '云林',
        c: '13'
      },
      {
        n: '屏东',
        c: '14'
      },
      {
        n: '台东',
        c: '15'
      },
      {
        n: '花莲',
        c: '16'
      },
      {
        n: '澎湖',
        c: '17'
      }
    ]
  },
  {
    n: '香港',
    c: '81',
    s: [
      {
        n: '香港岛',
        c: '01'
      },
      {
        n: '九龙',
        c: '02'
      },
      {
        n: '新界',
        c: '03'
      }
    ]
  },
  {
    n: '澳门',
    c: '82',
    s: [
      {
        n: '澳门半岛',
        c: '01'
      },
      {
        n: '氹仔岛',
        c: '02'
      },
      {
        n: '路环岛',
        c: '03'
      },
      {
        n: '路氹城',
        c: '04'
      }
    ]
  }
];
